[
  {
    "url": "https://en.wikipedia.org/wiki/List_of_last_survivors_of_historical_events",
    "content": "A historical event can be defined as any occurrence from the past regardless of significance, with the term \"history\" an umbrella term relating to past events and any associated memories, discoveries, collections, organizations, presentations, and/or interpretations of them. This differs from a historic event which is often less inclusive, and stands out as having made a significant impact on history itself.The following is a list of notable people documented as the last living individuals to have witnessed, survived or participated in significant historical events or who were the last living members of a historic group that directly contributed to such an event (e.g. Manhattan Project scientists). Excluded from this list are last living survivors of wars, speakers of languages, and others who are already recorded on pages representing more narrow categories.\n  Background shading indicates the individual is still living\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_television_shows_based_on_Indian_history",
    "content": "This is a list of notable television shows based on subjects of Indian history. Some shows listed below are fictionalised or dramatised shows based on historical events and people."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Rebellion_of_1857",
    "content": "The Indian Rebellion of 1857 was a major uprising in India in 1857–58 against the rule of the British East India Company, which functioned as a sovereign power on behalf of the British Crown. The rebellion began on 10 May 1857 in the form of a mutiny of sepoys of the Company's army in the garrison town of Meerut, 40 mi (64 km) northeast of Delhi. It then erupted into other mutinies and civilian rebellions chiefly in the upper Gangetic plain and central India, though incidents of revolt also occurred farther north and east. The rebellion posed a considerable threat to British power in that region, and was contained only with the rebels' defeat in Gwalior on 20 June 1858. On 1 November 1858, the British granted amnesty to all rebels not involved in murder, though they did not declare the hostilities to have formally ended until 8 July 1859. Its name is contested, and it is variously described as the Sepoy Mutiny, the Indian Mutiny, the Great Rebellion, the Revolt of 1857, the Indian Insurrection, and the First War of Independence.The Indian rebellion was fed by resentments born of diverse perceptions, including invasive British-style social reforms, harsh land taxes, summary treatment of some rich landowners and princes, as well as scepticism about the improvements brought about by British rule. Many Indians rose against the British; however, many also fought for the British, and the majority remained seemingly compliant to British rule. Violence, which sometimes betrayed exceptional cruelty, was inflicted on both sides, on British officers, and civilians, including women and children, by the rebels, and on the rebels, and their supporters, including sometimes entire villages, by British reprisals; the cities of Delhi and Lucknow were laid waste in the fighting and the British retaliation.After the outbreak of the mutiny in Meerut, the rebels quickly reached Delhi, whose 81-year-old Mughal ruler, Bahadur Shah Zafar, was declared the Emperor of Hindustan. Soon, the rebels had captured large tracts of the North-Western Provinces and Awadh (Oudh). The East India Company's response came rapidly as well. With help from reinforcements, Kanpur was retaken by mid-July 1857, and Delhi by the end of September. However, it then took the remainder of 1857 and the better part of 1858 for the rebellion to be suppressed in Jhansi, Lucknow, and especially the Awadh countryside. Other regions of Company-controlled India—Bengal province, the Bombay Presidency, and the Madras Presidency—remained largely calm. In Assam, a plan to reinstate the Ahom kingdom taking advantage of the situation elsewhere in India was set up, but it died off with the hanging of Maniram Dewan and Piyali Barua, and the subsequent forceful crushing of public reaction. In the Punjab, the Sikh princes crucially helped the British by providing both soldiers and support. The large princely states, Hyderabad, Mysore, Travancore, and Kashmir, as well as the smaller ones of Rajputana, did not join the rebellion, serving the British, in the Governor-General Lord Canning's words, as \"breakwaters in a storm.\"In some regions, most notably in Awadh, the rebellion took on the attributes of a patriotic revolt against British oppression. However, the rebel leaders proclaimed no articles of faith that presaged a new political system. Even so, the rebellion proved to be an important watershed in Indian and British Empire history. It led to the dissolution of the East India Company, and forced the British to reorganize the army, the financial system, and the administration in India, through passage of the Government of India Act 1858. India was thereafter administered directly by the British government in the new British Raj. On 1 November 1858, Queen Victoria issued a proclamation to Indians, which while lacking the authority of a constitutional provision, promised rights similar to those of other British subjects. In the following decades, when admission to these rights was not always forthcoming, Indians were to pointedly refer to the Queen's proclamation in growing avowals of a new nationalism."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Historical_reenactment",
    "content": "Historical reenactment (or re-enactment) is an educational or entertainment activity in which mainly amateur hobbyists and history enthusiasts put on uniforms and follow a plan to recreate aspects of a historical event or period. This may be as narrow as a specific moment from a battle, such as the reenactment of Pickett's Charge presented during the Great Reunion of 1913, or as broad as an entire period, such as Regency reenactment. \nWhile historical reenactors are generally amateurs, some participants are members of armed forces or historians. The participants, called reenactors, often do research on the equipment, uniform, and other gear they will carry or use. Reenactors buy the apparel or items they need from specialty stores or make items themselves. Historical reenactments cover a wide span of history, from the Roman empire to the major world wars and the Korean War of the 20th century.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_historical_films_set_in_Near_Eastern_and_Western_civilization",
    "content": "The historical drama or period drama is a film genre in which stories are based upon historical events and famous people. Some historical dramas are docudramas, which attempt an accurate portrayal of a historical event or biography, to the degree that the available historical research will allow. Other historical dramas are fictionalized tales that are based on an actual person and their deeds, such as Braveheart, which is loosely based on the 13th-century knight William Wallace's fight for Scotland's independence.\nDue to the sheer volume of films included in this genre and in the interest of continuity, this list is primarily focused on films pertaining to the history of Near Eastern and Western civilization.\nFor films pertaining to the history of East Asia, Central Asia, and South Asia, please refer also to the list of Asian historical drama films."
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_films_based_on_actual_events_(2000%E2%80%93present)",
    "content": "This is a list of films and miniseries that are based on actual events. All films on this list are from American production unless indicated otherwise."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Historical_fiction",
    "content": "Historical fiction is a literary genre in which the plot takes place in a setting related to the past events, but is fictional. Although the term is commonly used as a synonym for the historical romance, it can also be applied to other types of narrative, including theatre, opera, cinema, and television, as well as video games and graphic novels.\nAn essential element of historical fiction is that it is set in the past and pays attention to the manners, social conditions and other details of the depicted period. Authors also frequently choose to explore notable historical figures in these settings, allowing readers to better understand how these individuals might have responded to their environments. Some subgenres such as alternate history and historical fantasy insert speculative or ahistorical elements into a novel.\nWorks of historical fiction are sometimes criticized for lack of authenticity because of readerly criticism or genre expectations for accurate period details. This tension between historical authenticity, or historicity, and fiction frequently becomes a point of comment for readers and popular critics, while scholarly criticism frequently goes beyond this commentary, investigating the genre for its other thematic and critical interests.\nHistorical fiction as a contemporary Western literary genre has its foundations in the early-19th-century works of Sir Walter Scott and his contemporaries in other national literatures such as the Frenchman Honoré de Balzac, the American James Fenimore Cooper, and later the Russian Leo Tolstoy. However, the melding of \"historical\" and \"fiction\" in individual works of literature has a long tradition in most cultures; both western traditions (as early as Ancient Greek and Latin literature) as well as Eastern, in the form of oral and folk traditions (see mythology and folklore), which produced epics, novels, plays and other fictional works describing history for contemporary audiences."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Anglo-Indian_people",
    "content": "Anglo-Indian people fall into two different groups: those with mixed Indian and British ancestry, and people of British descent born or residing in India. The latter sense is now mainly historical, but confusions can arise. The Oxford English Dictionary, for example, gives three possibilities: \"Of mixed British and Indian parentage, of Indian descent but born or living in Britain or (chiefly historical) of English descent or birth but living or having lived long in India\". People fitting the middle definition are more usually known as British Asian or British Indian. This article focuses primarily on the modern definition, a distinct minority community of mixed Eurasian ancestry, whose first language is English. According to the Indian government , one is considered an Anglo-Indian if he or she has an British ancestor in paternal line. As the term Euro-Indians would be confused with Indo-Europeans, the group now also includes Hispano-Indians, those who have a Portuguese ancestor in paternal line, therefore the Anglo-Indians can have  either an Iberian or a British surname. The early wave of Greek settlers after Alexanders' conquest are wholly assimilated, so there are no Greek-Indians anymore.  \nThe All India Anglo-Indian Association, founded in 1926, has long represented the interests of this ethnic group; it holds that Anglo-Indians are unique in that they are Christians, speak English as their mother tongue, and have a historical link to both Europe and India. Anglo-Indians tend to identify as people of India, rather than of a specific region such as the Punjab or Bengal. 2 August is celebrated as World Anglo Indian Day.\nDuring the period of British rule in India, children born to unions between British men and Indian women formed the basis of the Anglo-Indian community. This new ethnic group formed a small yet significant portion of the population and became well represented in certain administrative roles. As Anglo-Indians were mostly isolated from both British and Indian society, their documented numbers dwindled from roughly 300,000 at the time of independence in 1947 to about 125,000 – 150,000 in modern day India. During much of the time that Britain ruled India (the Raj), British-Indian relationships faced stigma, which meant that the ethnicity of some Anglo-Indians was undocumented or identified incorrectly. As such, many have adapted to local communities in India or emigrated to the United Kingdom, Australia, Canada, the United States and New Zealand where they form part of the Indian diaspora.Similar communities can also be seen in other parts of the subcontinent, although in smaller numbers, such as the Anglo-Burmese people in Myanmar (Burma) and the Burgher people in Sri Lanka."
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_Indian_massacres_in_North_America",
    "content": "In the history of the European colonization of the Americas, an Indian massacre is any incident between European settlers and indigenous peoples wherein one group killed a significant number of the other group outside the confines of mutual combat in war.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_reservation",
    "content": "An Indian reservation is an area of land held and governed by a federally recognised Native American tribal nation which government is accountable to the U.S. Bureau of Indian Affairs and not to the state government in which it is located. Some of the country's 574 federally recognized tribes govern more than one \nof the 326 Indian reservations in the United States, while some share reservations, and others have no reservation at all. Historical piecemeal land allocations under the Dawes Act facilitated sales to non–Native Americans, resulting in some reservations becoming severely fragmented, with pieces of tribal and privately held land being treated as separate enclaves. This jumble of private and public real estate creates significant administrative, political and legal difficulties.The total area of all reservations is 56,200,000 acres (22,700,000 ha; 87,800 sq mi; 227,000 km2), approximately 2.3% of the total area of the United States and about the size of the state of Idaho. While most reservations are small compared to the average U.S. state, twelve Indian reservations are larger than the state of Rhode Island. The largest reservation, the Navajo Nation Reservation, is similar in size to the state of West Virginia. Reservations are unevenly distributed throughout the country, the majority being situated west of the Mississippi River and occupying lands that were first reserved by treaty (Indian Land Grants) from the public domain.Because recognized Native American nations possess tribal sovereignty, albeit of a limited degree, laws within tribal lands may vary from those of the surrounding and adjacent states. For example, these laws can permit casinos on reservations located within states which do not allow gambling, thus attracting tourism. The tribal council generally has jurisdiction over the reservation, not the state or federal government of the United States. Different reservations have different systems of government, which may or may not replicate the forms of government found outside the reservation. Most Native American reservations were established by the federal government but a small number, mainly in the East, owe their origin to state recognition.The term \"reservation\" is a legal designation. It comes from the conception of the Native American nations as independent sovereigns at the time the U.S. Constitution was ratified.  Thus, early peace treaties (often signed under conditions of duress or fraud), in which Native American nations surrendered large portions of their land to the United States, designated parcels which the nations, as sovereigns, \"reserved\" to themselves, and those parcels came to be called \"reservations\".  The term remained in use after the federal government began to forcibly relocate nations to parcels of land to which they had no historical connection.\nToday the majority of American Indians and Alaska Natives live outside the reservations, mainly in the larger western cities such as Phoenix and Los Angeles. In 2012, there were over 2.5 million Native Americans, with 1 million living on reservations."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Parmanu:_The_Story_of_Pokhran",
    "content": "Parmanu: The Story of Pokhran (transl. Atom; Hindi pronunciation: [pəɾmaːɳʊ]) is a 2018 Indian Hindi language historical drama film directed by Abhishek Sharma and jointly written by Saiwyn Quadras, Sanyuktha Chawla Sheikh and Sharma. It was produced by Zee Studios, JA Entertainment and KYTA Productions banners. The film is based on the nuclear bomb test explosions conducted by the Indian Army at Pokhran in 1998. It stars John Abraham, Diana Penty and Boman Irani in lead roles.\nParmanu was earlier slated to release on 8 December 2017, but was postponed to avoid clashing with Padmaavat (2018). It was further delayed owing to conflicts between the producers of the film, Abraham and KriArj Entertainment. It was eventually released on 25 May 2018.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Historical_revisionism",
    "content": "In historiography, historical revisionism is the re-interpretation of a historical account. It usually involves challenging the orthodox (established, accepted or traditional) views held by professional scholars about a historical event or time-span or phenomenon, introducing contrary evidence, or reinterpreting the motivations and decisions of the people involved. The revision of the historical record can reflect new discoveries of fact, evidence, and interpretation, which then results in revised history. In dramatic cases, revisionism involves a reversal of older moral judgments.\nAt a basic level, legitimate historical revisionism is a common and not especially controversial process of developing and refining the writing of histories. Much more controversial is the reversal of moral findings, whereby what mainstream historians had considered (for example) positive forces are depicted as negative. Such revisionism, if challenged (especially in heated terms) by the supporters of the previous view, can become an illegitimate form of historical revisionism known as historical negationism if it involves inappropriate methods such as the use of forged documents or implausible distrust of genuine documents, attributing false conclusions to books and sources, manipulating statistical data, and deliberately mis-translating texts. This type of historical revisionism can present a re-interpretation of the moral meaning of the historical record. Negationists use the term revisionism to portray their efforts as legitimate historical inquiry; this is especially the case when revisionism relates to Holocaust denial."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Flag_of_India",
    "content": "The National Flag of India (Hindi: Tiraṅgā) is a horizontal rectangular tricolour of India saffron, white and India green; with the Ashoka Chakra, a 24-spoke wheel, in navy blue at its centre. It was adopted in its present form during a meeting of the Constituent Assembly held on 22 July 1947, and it became the official flag of the Dominion of India on 15 August 1947. The flag was subsequently retained as that of the Republic of India. In India, the term \"tricolour\" almost always refers to the Indian national flag. The flag is based on the Swaraj flag, a flag of the Indian National Congress designed by Pingali Venkayya.By law, the flag is to be made of khadi, a special type of hand-spun cloth or silk, made popular by Mahatma Gandhi. The manufacturing process and specifications for the flag are laid out by the Bureau of Indian Standards. The right to manufacture the flag is held by the Khadi Development and Village Industries Commission, who allocates it to regional groups. As of 2009, the Karnataka Khadi Gramodyoga Samyukta Sangha has been the sole manufacturer of the flag.\nUsage of the flag is governed by the Flag Code of India and other laws relating to the national emblems. The original code prohibited use of the flag by private citizens except on national days such as the Independence day and the Republic Day. In 2002, on hearing an appeal from a private citizen, Naveen Jindal, the Supreme Court of India directed the Government of India to amend the code to allow flag usage by private citizens. Subsequently, the Union Cabinet of India amended the code to allow limited usage. The code was amended once more in 2005 to allow some additional use including adaptations on certain forms of clothing. The flag code also governs the protocol of flying the flag and its use in conjunction with other national and non-national flags."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Rocks_Beach,_Florida",
    "content": "Indian Rocks Beach, or IRB, is a city in Pinellas County, Florida, United States. The population was 4,286 at the 2018 census. Indian Rocks Beach is part of the Tampa-St. Petersburg-Clearwater, FL Metropolitan Statistical Area. Located on the barrier island Sand Key, it has over two miles of beach along the Gulf of Mexico, with 26 public beach accesses.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/21_Sarfarosh_-_Saragarhi_1897",
    "content": "21 Sarfarosh - Saragarhi 1897 is an Indian historical drama television series starring Mohit Raina, Prakhar Shukla and Mukul Dev. The show is based on the Battle of Saragarhi, fought between Sikh soldiers of the British Indian Army and Pashtun Orakzai tribesmen. Produced by Contiloe Entertainment, it ran from 12 February to 11 May 2018, on Discovery Jeet.Netflix acquired the international broadcast rights of the series for 190 Countries.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_cuisine",
    "content": "Indian cuisine consists of a variety of regional and traditional cuisines native to the Indian subcontinent. Given the diversity in soil, climate, culture, ethnic groups, and occupations, these cuisines vary substantially and use locally available spices, herbs, vegetables, and fruits.\nIndian food is also heavily influenced by religion, in particular Hinduism and Islam, cultural choices and traditions.Historical events such as invasions, trade relations, and colonialism have played a role in introducing certain foods to this country. The Columbian discovery of the New World brought a number of new vegetables and fruit to India. A number of these such as potatoes, tomatoes, chillies, peanuts, and guava have become staples in many regions of India.Indian cuisine has shaped the history of international relations; the spice trade between India and Europe was the primary catalyst for Europe's Age of Discovery. Spices were bought from India and traded around Europe and Asia. Indian cuisine has influenced other cuisines across the world, especially those from Europe (especially Britain), the Middle East, Southern African, East Africa, Southeast Asia, North America, Mauritius, Fiji, Oceania, and the Caribbean."
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_films_based_on_actual_events",
    "content": "This is a list of films and miniseries that are based on actual events. All films on this list are from American production unless indicated otherwise.\nNot all films have remained true to the genuine history of the event or the characters they are portraying, often adding action and drama to increase the substance and popularity of the film. True story films gained popularity in the late 1980s and early 1990s, with the production of films based on actual events that first aired on CBS, ABC, and NBC. The Movies Based on True Stories Database by Traciy Curry-Reyes was the first to compile a list of films based on true stories, and was the first site to coin the term \"movies based on true stories\" in the 1990s. This list should only include films supported by a Wikipedia article."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Historical_trauma",
    "content": "Historical trauma (HT), as used by social workers, historians, and psychologists, refers to the cumulative emotional harm of an individual or generation caused by a traumatic experience or event. Historical Trauma Response (HTR) refers to the manifestation of emotions and actions that stem from this perceived trauma.\nAccording to its advocates, HTR is exhibited in a variety of ways, most prominently through substance abuse, which is used as a vehicle for attempting to numb pain. This model seeks to use this to explain other self-destructive behaviour, such as suicidal thoughts and gestures, depression, anxiety, low self-esteem, anger, violence and difficulty recognising and expressing emotions. Many historians and scholars believe the manifestations of violence and abuse in certain communities are directly associated with the unresolved grief that accompanies continued trauma.Historical trauma, and its manifestations, are seen as an example of Transgenerational trauma (though the existence of transgenerational trauma itself is disputed). For example, a pattern of maternal abandonment of a child might be seen across three generations, or the actions of an abusive parent might be seen in continued abuse across generations. These manifestations can also stem from the trauma of events, such as the witnessing of war, genocide, or death.  For these populations that have witnessed these mass level traumas (e.g., war, genocide, colonialism), several generations later these populations tend to have higher rates of disease.Maria Yellow Horse Brave Heart first developed the concept of historical trauma while working with Lakota communities in the 1980s. Since then, many other researchers have developed the concept and applied it to other populations, such as African Americans and Holocaust survivors. \n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Viceroy%27s_House_(film)",
    "content": "Viceroy's House is a 2017 British-Indian fictional historical drama film directed by Gurinder Chadha and written by Paul Mayeda Berges, Moira Buffini, and Chadha. The film stars Hugh Bonneville, Gillian Anderson, Manish Dayal, Huma Qureshi, and Michael Gambon. It was selected to be screened out of competition at the 67th Berlin International Film Festival.The film was released in the United Kingdom on 3 March 2017, while the Hindi dubbed version titled Partition: 1947 was released in India on 18 August 2017, 3 days after its 70th Independence Day. It was released worldwide on 1 September 2017. Viceroy's House is based on Freedom at Midnight by Larry Collins and Dominique Lapierre, and The Shadow of the Great Game: The Untold Story of Partition by Narendra Singh Sarila.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/American_Indian_Wars",
    "content": "The American Indian Wars, also known as the American Frontier Wars, the First Nations Wars in Canada (French: Guerres des Premières Nations), and the Indian Wars, were fought by European governments and colonists in North America, and later by the United States and Canadian governments and American and Canadian settlers, against various American Indian and First Nation tribes. These conflicts occurred in North America from the time of the earliest colonial settlements in the 17th century until the early 20th century. The various wars resulted from a wide variety of factors. The European powers and their colonies also enlisted allied Indian tribes to help them conduct warfare against each other's colonial settlements. After the American Revolution, many conflicts were local to specific states or regions and frequently involved disputes over land use; some entailed cycles of violent reprisal.\nAs settlers spread westward across North America after 1780, armed conflicts increased in size, duration, and intensity between settlers and various Indian and First Nation tribes. The climax came in the War of 1812, when major Indian coalitions in the Midwest and the South fought against the United States and lost. Conflict with settlers became much less common and was usually resolved by treaty, often through sale or exchange of territory between the federal government and specific tribes. The Indian Removal Act of 1830 authorized the American government to enforce Indian removal from east of the Mississippi River to Indian Territory west on the American frontier, especially what became Oklahoma. The federal policy of removal was eventually refined in the West, as American settlers kept expanding their territories, to relocate Indian tribes to reservations."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Accounting_Standards",
    "content": "Indian Accounting Standard (abbreviated as Ind-AS) is the Accounting standard adopted by companies in India and issued under the supervision of Accounting Standards Board (ASB) which was constituted as a body in the year 1977. ASB is a committee under Institute of Chartered Accountants of India (ICAI) which consists of representatives from government department, academicians, other professional bodies viz. ICAI, representatives from ASSOCHAM, CII, FICCI, etc. ICAI is an independent body formed under an act of parliament.\nThe Ind AS are named and numbered in the same way as the International Financial Reporting Standards (IFRS). National Financial Reporting Authority (NFRA) recommend these standards to the Ministry of Corporate Affairs (MCA). MCA has to spell out the accounting standards applicable for companies in India. As on date MCA has notified 41 Ind AS. This shall be applied to the companies of financial year 2015-16 voluntarily and from 2016-17 on a mandatory basis.\nBased on the international consensus, the regulators will separately notify the date of implementation of Ind-AS for the banks, insurance companies etc. Standards for the computation of Tax has been notified as ICDS in February 2015.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Anti-Indian_sentiment",
    "content": "Anti-Indian sentiment refers to negative feelings and hatred towards the Republic of India, Indian people, and Indian culture. Indophobia is formally defined in the context of anti-Indian prejudice as \"a tendency to react negatively towards people of Indian extraction against aspects of Indian culture and normative habits\"."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Veerapandiya_Kattabomman_(film)",
    "content": "Veerapandiya Kattabomman (transl. Kattabomman, the Brave Warrior) is a 1959 Indian Tamil-language biographical war film produced and directed by B. R. Panthulu. The film stars Sivaji Ganesan, Gemini Ganesan, Padmini, S. Varalakshmi, and Ragini, with V. K. Ramasamy and Javar Seetharaman in supporting roles. Its soundtrack and score were composed by G. Ramanathan.\nThe film is loosely based on the story of Veerapandiya Kattabomman, the 18th-century South Indian chieftain who rebelled against the East India Company. It was an adaptation of the play of the same name by Sakthi T. K. Krishnasamy which featured Sivaji Ganesan as the title character, and premiered in August 1957. Principal photography began in October the same year, and took place mainly in Jaipur and Madras (now Chennai) till late 1958. This was the first Tamil film released in Technicolor.\nVeerapandiya Kattabomman premiered in London on 10 May 1959, and was released in Tamil Nadu six days later. It was critically acclaimed; Sivaji Ganesan's performance as Kattabomman received widespread praise, although some film scholars considered elements in the film, particularly the portrayal of the title character, to be historically inaccurate. It was a commercial success, running for over 25 weeks in theatres and becoming a silver jubilee film.\nVeerapandiya Kattabomman was the first in Tamil cinema to receive international awards for Best Film, Best Actor, and Best Music Director at the 1960 Afro-Asian Film Festival in Cairo, and received a Certificate of Merit as part of the National Film Award for Best Feature Film in Tamil. Veerapandiya Kattabomman was re-released in 1984, and a digitally-restored version was released on 21 August 2015; both were commercially successful.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/National_Film_Awards",
    "content": "The National Film Awards is the most prominent film award ceremony in India. Established in 1954, it has been administered, along with the International Film Festival of India and the Indian Panorama, by the Indian government's Directorate of Film Festivals since 1973.Every year, a national panel appointed by the government selects the winning entry, and the award ceremony is held in New Delhi, where the President of India presents the awards. This is followed by the inauguration of the National Film Festival, where the award-winning films are screened for the public. Declared for films produced in the previous year across the country, they hold the distinction of awarding merit to the best of Indian cinema overall, as well as presenting awards for the best films in each region and language of the country."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Shunga_Empire",
    "content": "The Shunga Empire (IAST: Śuṅga) was an ancient Indian dynasty from Magadha that controlled areas of the central and eastern Indian subcontinent from around 184 to 75 BCE. The dynasty was established by Pushyamitra Shunga, after taking the throne of the Maurya Empire. Its capital was Pataliputra, but later emperors such as Bhagabhadra also held court at Besnagar (modern Vidisha) in eastern Malwa.Pushyamitra Shunga ruled for 36 years and was succeeded by his son Agnimitra. There were ten Shunga rulers. However, after the death of Agnimitra, the second king of the dynasty, the empire rapidly disintegrated: inscriptions and coins indicate that much of northern and central India consisted of small kingdoms and city-states that were independent of any Shunga hegemony. The dynasty is noted for its numerous wars with both foreign and indigenous powers. They fought the Kalinga, the Satavahana dynasty, the Indo-Greek Kingdom and possibly the Panchalas and Mitras of Mathura.\nArt, education, philosophy, and other forms of learning flowered during this period including small terracotta images, larger stone sculptures, and architectural monuments such as the stupa at Bharhut, and the renowned Great Stupa at Sanchi. Shunga rulers helped to establish the tradition of royal sponsorship of learning and art. The script used by the empire was a variant of Brahmi script and was used to write Sanskrit.\nThe Shunga Empire played an imperative role in patronising culture at a time when some of the most important developments in Hindu thought were taking place. Patanjali's Mahābhāṣya was composed in this period. Artistry also progressed with the rise of the Mathura art style.\nThe last of the Shunga emperors was Devabhuti (83–73 BCE). He was assassinated by his minister (Vasudeva Kanva) and is said to have been overfond of the company of women. The Shunga dynasty was then replaced by the subsequent Kanvas. The Kanva dynasty succeeded the Shungas around 73 BCE.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Kesari_(2019_film)",
    "content": "Kesari (transl. Saffron) is a 2019 Indian Hindi-language war film written and directed by Anurag Singh. It was jointly produced by Aruna Bhatia, Karan Johar, Hiroo Yash Johar, Apoorva Mehta, and Sunir Khetarpal under the banners of Dharma Productions, Cape of Good Films, Azure Entertainment, and Zee Studios. The film stars Akshay Kumar with Parineeti Chopra in a special appearance, Vikram Singh Chauhan, Sarwar, Vansh Bhardwaj, Jaspreet Singh, Vivek Saini, Vikram Kochhar, and Rakesh Sharma in supporting roles. It follows the events leading to the Battle of Saragarhi, a battle between 21 soldiers of the 36th Sikhs of the British Indian Army and 10,000 Afridi and Orakzai Pashtun tribesmen in 1897.\nInitially planned as a production collaboration between Salman Khan and Johar with Kumar starring in the lead role, Kesari was announced in October 2017, with Kumar and Johar reprising their responsibilities; Khan later quit the project. Parineeti Chopra was cast as the wife of Kumar's character. Principal photography for the film began in January 2018 and concluded in December. The soundtrack was composed by Tanishk Bagchi, Arko Pravo Mukherjee, Chirantan Bhatt, Jasbir Jassi, Gurmoh and Jasleen Royal with lyrics written by Kumaar, Manoj Muntashir, Kunwar Juneja and Bagchi. Produced on a budget of ₹80 crore (equivalent to ₹84 crore or US$11 million in 2020), the film was distributed internationally by Zee Studios.The film was released in India during the Holi festival, on 21 March 2019. It received positive reviews from critics, who appreciated performances of ensemble cast, visuals, production values, art direction, action sequences, and tribute, it had a good start at the box office, while the opening day morning collection was affected by Holi-related celebrations. The film grossed over ₹100 crore worldwide in its opening weekend. It grossed over ₹207.09 crores worldwide, becoming one of the highest-grossing Bollywood films of 2019.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Raag_Desh_(film)",
    "content": "Raag Desh (transl. Love the country) is a 2017 Indian historical action drama film directed by Tigmanshu Dhulia and produced by Gurdeep Singh Sappal and Rajya Sabha TV. The film is based on Indian National Army trials, the joint court martial of  Indian National Army officers Colonel Prem Sahgal, Colonel Gurbaksh Singh Dhillon, Major Shah Nawaz Khan. The leading roles in Raag Desh have been played by Kunal Kapoor, Amit Sadh, Mohit Marwah and Mrudula Murali. The film was released on July 28, 2017. Rishi Punjabi is the cinematographer of the film."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Mangal_Pandey:_The_Rising",
    "content": "Mangal Pandey: The Rising (internationally known as The Rising: Ballad of Mangal Pandey) is a 2005 Indian historical biographical drama film based on the life of Mangal Pandey, an Indian soldier known for helping to spark the Indian rebellion of 1857 (also known as The First War of Indian Independence).\nIt is directed by Ketan Mehta, produced by Bobby Bedi and with a screenplay by Farrukh Dhondy. The lead role is played by Aamir Khan, marking his comeback after he had gone into hiatus after Dil Chahta Hai (2001). It was a box office flop.\nIt premiered in the Marché du Film section of the 2005 Cannes Film Festival. It was the fourth highest-grossing film of 2005."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_independence_movement",
    "content": "The Indian independence movement was a series of historic events with the ultimate aim of ending British rule in India. It lasted from 1857 to 1947.The first nationalistic revolutionary movement for Indian independence emerged from Bengal. It later took root in the newly formed Indian National Congress with prominent moderate leaders seeking the right to appear for Indian Civil Service examinations in British India, as well as more rights (economical in nature) for the people of the soil. The early part of the 20th century saw a more radical approach towards political self-rule proposed by leaders such as the Lal Bal Pal triumvirate, Aurobindo Ghosh and V. O. Chidambaram Pillai.The last stages of the self-rule struggle from the 1920s was characterized by Congress's adoption of Mahatma Gandhi's policy of non-violence and civil disobedience, and several other campaigns. Poets and writers such as Rabindranath Tagore, Subramania Bharati, and Bankim Chandra Chattopadhyay spread patriotic awareness. This included Bhagat Singh, Raj Guru, Sukhdeo, Chandrashekhar aazad and most importantly Netaji Subhash Chandra Bose with his Army. Female leaders like Sarojini Naidu, Pritilata Waddedar, and Kasturba Gandhi were just a few of the women of the Indian independence movement that promoted the emancipation of Indian women and their participation in the freedom struggle. B. R. Ambedkar championed the cause of the \"disadvantaged\" sections of Indian society.The Indian independence movement encompassed all sections of society. It was in constant ideological evolution. Although the underlying ideology was anti-colonial, it was supported by a vision of independent, economic development coupled with a secular, democratic, republican, and civil-libertarian political structure. After the 1930s, the movement took on a strong socialist orientation. The work of these various movements ultimately led to the Indian Independence Act 1947, which ended suzerainty in India, and created Pakistan.\nIndia remained a Crown Dominion until 26 January 1950, when the Constitution of India came into force, establishing the Republic of India; Pakistan was a dominion until 1956 when it adopted its first republican constitution. In 1971, East Pakistan declared independence as the People's Republic of Bangladesh.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Sino-Indian_War",
    "content": "The Sino-Indian War between China and India occurred in October–November 1962. A disputed Himalayan border was the main cause of the war. There had been a series of violent border skirmishes between the two countries after the 1959 Tibetan uprising, when India granted asylum to the Dalai Lama. India initiated a defensive Forward Policy from 1960 to hinder Chinese military patrols and logistics, in which it placed outposts along the border, including several north of the McMahon Line, the eastern portion of the Line of Actual Control proclaimed by Chinese Premier Zhou Enlai in 1959.Chinese military action grew increasingly aggressive after India rejected proposed Chinese diplomatic settlements throughout 1960–1962, with China re-commencing previously-banned \"forward patrols\" in Ladakh from 30 April 1962. China finally abandoned all attempts of peaceful resolution on 20 October 1962, invading disputed territory along the 3,225 kilometres (2,004 mi) long Himalayan border in Ladakh and across the McMahon Line. Chinese troops pushed back Indian forces in both theatres, capturing Rezang La in Chushul in the western theatre, as well as Tawang in the eastern theatre. The war ended when China declared a ceasefire on 20 November 1962, and simultaneously announced its withdrawal to its claimed \"Line of Actual Control\".\nMuch of the fighting took place in harsh mountain conditions, entailing large-scale combat at altitudes of over 4,000 metres (13,000 feet). The Sino-Indian War was also notable for the lack of deployment of naval and aerial assets by either China or India.\nAs the Sino-Soviet split heated up, Moscow made a major effort to support India, especially with the sale of advanced MiG fighter-aircraft. The United States and Britain refused to sell advanced weaponry to India, causing it to turn to the Soviet Union."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Chittagong_(film)",
    "content": "Chittagong is a 2012 Indian historical war drama film directed by Bedabrata Pain. It stars Manoj Bajpayee in the lead role and is based upon events of British India's Chittagong Uprising. The film features music by trio Shankar–Ehsaan–Loy and sound by Resul Pookutty. The world premier of film was on 10 April 2012. Chittagong released on 12 October 2012 and nett grossed Rs 3.1 million at the  Indian box office. This movie won the 60th National Film Awards for the Best Debut Film of a Director."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Ocean",
    "content": "The Indian Ocean is the third-largest of the world's five oceanic divisions, covering 70,560,000 km2 (27,240,000 sq mi) or 19.8% of the water on Earth's surface. It is bounded by Asia to the north, Africa to the west and Australia to the east. To the south it is bounded by the Southern Ocean or Antarctica, depending on the definition in use. Along its core, the Indian Ocean has some large marginal or regional seas such as the Arabian Sea, the Laccadive Sea, the Somali Sea, Bay of Bengal, and the Andaman Sea."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Americans",
    "content": "Indian Americans or Indo-Americans are citizens of the United States with ancestry from India. The United States Census Bureau uses the term Asian Indian to avoid confusion with Native Americans. With a population of almost four million, Indian Americans make up 1.2% of the U.S. population and are the largest group of South Asian Americans, as well as the second largest group of Asian Americans after Chinese Americans."
  },
  {
    "url": "https://en.wikipedia.org/wiki/The_Empire_(TV_series)",
    "content": "The Empire is an Indian historical fiction period drama streaming television series created by Nikkhil Advani and directed by Mitakshara Kumar based on the novel series Empire of the Moghul by Alex Rutherford for Disney+ Hotstar. The series was premiered on Disney+ Hotstar on 27 August 2021.The first season of the series opened to generally favourable reviews with praise for the show's visuals, sets, costumes and the performance of the main cast, with a positive consensus on Shabana Azmi's portrayal of Ësan Dawlat and criticism for poor VFX in a few scenes."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Native_Americans_in_the_United_States",
    "content": "Native Americans, also known as American Indians, First Americans, Indigenous Americans and other terms, are the Indigenous peoples of the United States; sometimes including Hawaii and territories of the United States, and other times limited to the mainland. There are 574 federally recognized tribes living within the US, about half of which are associated with Indian reservations. \"Native Americans\" (as defined by the United States Census) are Indigenous tribes that are originally from the contiguous United States, along with Alaska Natives.\nIndigenous peoples of the United States who are not American Indian or Alaska Native include Native Hawaiians, Samoans, and Chamorros. The US Census groups these peoples as \"Native Hawaiian and other Pacific Islander\".\nThe ancestors of living Native Americans arrived in what is now the United States at least 15,000 years ago, possibly much earlier, from Asia via Beringia. A vast variety of peoples, societies and cultures subsequently developed. European colonization of the Americas, which began in 1492, resulted in a precipitous decline in Native American population because of new diseases, wars, ethnic cleansing, and enslavement, all of which culminated in a widespread genocide. After its formation, the United States, as part of its policy of settler colonialism, continued to wage war and perpetrated massacres against many Native American peoples, removed them from their ancestral lands, and subjected them to one-sided treaties and to discriminatory government policies, later focused on forced assimilation, into the 20th century. Since the 1960s, Native American self-determination movements have resulted in positive changes to the lives of many Native Americans, though there are still many contemporary issues faced by them. Today, there are over five million Native Americans in the United States, 78% of whom live outside reservations: California, Arizona and Oklahoma have the largest populations of Native Americans in the United States. Most Native Americans live in small towns or rural areas.\nWhen the United States was created, established Native American tribes were generally considered semi-independent nations, as they generally lived in communities separate from white settlers. The federal government signed treaties at a government-to-government level until the Indian Appropriations Act of 1871 ended recognition of independent native nations, and started treating them as \"domestic dependent nations\" subject to federal law. This law did preserve the rights and privileges agreed to under the treaties, including a large degree of tribal sovereignty. For this reason, many Native American reservations are still independent of state law and the actions of tribal citizens on these reservations are subject only to tribal courts and federal law.\nThe Indian Citizenship Act of 1924 granted U.S. citizenship to all Native Americans born in the United States who had not yet obtained it. This emptied the \"Indians not taxed\" category established by the United States Constitution, allowed natives to vote in state and federal elections, and extended the Fourteenth Amendment protections granted to people \"subject to the jurisdiction\" of the United States. However, some states continued to deny Native Americans voting rights for several decades. Bill of Rights protections do not apply to tribal governments, except for those mandated by the Indian Civil Rights Act of 1968."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Television_Academy_Awards",
    "content": "The Indian Television Academy Awards, also known as the ITA Awards, is an annual event organised by the Indian Television Academy to honour excellence of Indian Television."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Armed_Forces",
    "content": "The Indian Armed Forces are the military forces of the Republic of India. It consists of three professional uniformed services: the Indian Army, Indian Navy, and Indian Air Force. Additionally, the Indian Armed Forces are supported by the Central Armed Police Forces, Assam Rifles, Indian Coast Guard and Special Frontier Force and various inter-service commands and institutions such as the Strategic Forces Command, the Andaman and Nicobar Command and the Integrated Defence Staff. The President of India is the Supreme Commander of the Indian Armed Forces. The Indian Armed Forces are under the management of the Ministry of Defence (MoD) of the Government of India. With strength of over 1.4 million active personnel, it is the world's second-largest military force and has the world's largest volunteer army. It also has the third-largest defence budget in the world. As per 2015 Credit Suisse report, the Indian Armed Forces is the world's fifth-most powerful military, whereas the 2020 GlobalFirepower report lists it as the fourth most-powerful military.It is important to note that the Central Armed Police Forces, which are referred to as 'Armed Police Forces' are not armed forces. As such they are headed by civilian officers from the Indian Police Service and are under the control of the Ministry of Home Affairs, not the Ministry of Defence.\nThe Indian armed forces have been engaged in a number of major military operations, including: the Indo-Pakistani wars of 1947, 1965 and 1971, the Portuguese-Indian War, the Sino-Indian War, the 1967 Chola incident, the 1987 Sino-Indian skirmish, the Kargil War, and the Siachen conflict among others. India honours its armed forces and military personnel annually on Armed Forces Flag Day, 7 December. Armed with the nuclear triad, the Indian armed forces are steadily undergoing modernisation, with investments in areas such as futuristic soldier systems and missile defence systems.The Department of Defence Production of the Ministry of Defence is responsible for the indigenous production of equipment used by the Indian Armed Forces. It comprises the 41 Indian Ordnance Factories under the control of the Ordnance Factories Board, and eight Defence PSUs namely: HAL, BEL, BEML, BDL, MDL, GSL, GRSE and Midhani. India remains one of the largest importer of defence equipment with Russia, Israel, France and the United States being the top foreign suppliers of military equipment. The Government of India has launched a Make in India initiative to indigenise manufacturing and reduce dependence on imports, including defence imports and procurement."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Timeline_of_Indian_history",
    "content": "This is a timeline of Indian history, comprising important legal and territorial changes and political events in India and its predecessor states. To read about the background to these events, see History of India.  See also the list of governors-general of India, list of prime ministers of India and Years in India."
  },
  {
    "url": "https://en.wikipedia.org/wiki/2015_in_British_television",
    "content": "This is a list of events that took place in 2015 related to British television."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Gajakesari",
    "content": "Gajakesari is a 2014 Indian Kannada-language historical action film directed by cinematographer Krishna and produced by Jayanna and Bogendra. The film stars Yash in leading role along with Amulya and Anant Nag. The film also prominently features an elephant named Arjuna from Waynad, Kerala. Actor Prakash Raj plays as narrator for the film to introduce Yash's character. Also uncredited writer Sai Prasad did the still photography and concept design for the making of the movie. This film is also dubbed in Hindi as Gajakeasari:The Big Lion."
  },
  {
    "url": "https://en.wikipedia.org/wiki/American_Indian_boarding_schools",
    "content": "American Indian boarding schools, also known more recently as American Indian Residential Schools, were established in the United States from the mid 17th to the early 20th centuries with a primary objective of \"civilizing\" or assimilating Native American children and youth into Euro-American culture. In the process, these schools denigrated Native American culture and made children give up their languages and religion. At the same time the schools provided a basic Western education. These boarding schools were first established by Christian missionaries of various denominations. The missionaries were often approved by the federal government to start both missions and schools on reservations, especially in the lightly populated areas of the West. In the late 19th and early 20th centuries especially, the government paid religious orders to provide basic education to Native American children on reservations, and later established its own schools on reservations. The Bureau of Indian Affairs (BIA) also founded additional off-reservation boarding schools based on the assimilation model. These sometimes drew children from a variety of tribes. In addition, religious orders established off-reservation schools.\nChildren were typically immersed in European-American culture. Schools forced removal of indigenous cultural signifiers: cutting the children's hair, having them wear American-style uniforms, forbidding them from speaking their indigenous languages, and replacing their tribal names with English-language names (saints names under some religious orders) for use at the schools, as part of assimilation and to \"Christianize\" them. The schools were usually harsh, especially for younger children who had been forcibly separated from their families and forced to abandon their Native American identities and cultures. Children also sometimes died in the school system due to infectious disease. Investigations of the later twentieth century have revealed many documented cases of sexual, manual, physical and mental abuse occurring mostly in church-run schools.\nSummarizing recent scholarship from Native perspectives, Dr. Julie Davis said:\n\nBoarding schools embodied both victimization and agency for Native people and they served as sites of both cultural loss and cultural persistence.  These institutions, intended to assimilate Native people into mainstream society and eradicate Native cultures, became integral components of American Indian identities and eventually fueled the drive for political and cultural self-determination in the late 20th century.\nSince those years, tribal nations have carried out political activism and gained legislation and federal policy that gives them the power to decide how to use federal education funds, how they educate their children, and the authority to establish their own community-based schools. Tribes have also founded numerous tribal colleges and universities on reservations. Tribal control over their schools has been supported by federal legislation and changing practices by the BIA. By 2007, most of the schools had been closed down and the number of Native American children in boarding schools had declined to 9,500. Although there are hundreds of deceased Indigenous children yet to be found, investigations are increasing across the United States.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/All_India_Anglo-Indian_Association",
    "content": "The All India Anglo-Indian Association is an organisation representing the interests of Anglo-Indians. It was founded in 1926 in colonial India by Sir Henry Gidney. It has sixty-two branches in all of India.The All India Anglo-Indian Association holds that Anglo-Indians are unique in that they are Christians, speak English as their mother tongue, as well as have a historical link to both Europe and India. During the era of the British Raj in India, the then president of the All-India Anglo-Indian Association represented the Anglo-Indian community of undivided India at the Round Table Conferences. At the time of the Indian independence movement, the All-India Anglo-Indian Association opposed the partition of India; its then president Frank Anthony \"fought for the best interests of his community as Indians, not Britishers,\" criticizing the British for \"racial discrimination in matters of pay and allowances, and for failing to acknowledge the sterling military and civil contributions made by Anglo-Indians to the Raj\". In September 1942, at the organisation's annual general meeting, the All India Anglo-Indian Association affirmed its love for and loyalty to India. The organisation's efforts under the presidency of Anthony led to Article 331 being included in the Constitution of India: \"Notwithstanding anything in Article 170, the Governor of a State may, if he is of opinion that the Anglo-Indian community needs representation in the Legislative Assembly of the State and is not adequately represented therein, [nominate one member of that community to the Assembly].\"The various branches of the All India Anglo-Indian Association arrange events throughout the year. This includes celebrations of Christian holidays such as Christmas, as well as sporting events with an annual hockey tournament being at the epicentre."
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_equipment_of_the_Indian_Army",
    "content": "This is a list of present equipment used by the Indian Army."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Historical_negationism",
    "content": "Historical negationism, also called denialism, is falsification or distortion of the historical record. It should not be conflated with historical revisionism, a broader term that extends to newly evidenced, fairly reasoned academic reinterpretations of history. In attempting to revise the past, illegitimate historical revisionism may use techniques inadmissible in proper historical discourse, such as presenting known forged documents as genuine, inventing ingenious but implausible reasons for distrusting genuine documents, attributing conclusions to books and sources that report the opposite, manipulating statistical series to support the given point of view, and deliberately mistranslating texts.Some countries, such as Germany, have criminalized the negationist revision of certain historical events, while others take a more cautious position for various reasons, such as protection of free speech; others mandate negationist views, such as California and Japan, where schoolchildren are explicitly prevented from learning about the California genocide and Japanese war crimes, respectively. Notable examples of negationism include Holocaust denial, Armenian genocide denial, the Lost Cause of the Confederacy, the myth of the clean Wehrmacht, Japanese history textbook controversies, and historiography in the Soviet Union during the Stalin era. Some notable historical negationists include Arthur Butz, David Irving, and Shinzo Abe. In literature, the consequences of historical negationism have been imaginatively depicted in some works of fiction, such as Nineteen Eighty-Four, by George Orwell. In modern times, negationism may spread via new media, such as the Internet."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_National_Congress",
    "content": "The Indian National Congress (abbr. INC), colloquially the Congress Party but often simply Congress, is a political party in India with widespread roots. Founded in 1885, it was the first modern nationalist movement to emerge in the British Empire in Asia and Africa. From the late 19th century, and especially after 1920, under the leadership of Mahatma Gandhi, Congress became the principal leader of the Indian independence movement. Congress led India to independence from the United Kingdom, and powerfully influenced other anti-colonial nationalist movements in the British Empire. Due to its enduring history, the Congress is often called the \"grand old party\".\nThe Congress today is one of the two major political parties in India, along with its main rival the Bharatiya Janata Party. It is a \"big tent\" party whose platform is generally considered to lie in the centre to centre-left of Indian politics.  On social issues, it advocates secular policies that encourage equal opportunity, right to health, civil liberty and welfare of weaker sections and minorities, with support for a mixed economy. As of 2021, in the 17 general elections since independence, it has won an outright majority on seven occasions and has led the ruling coalition a further three times, heading the central government for more than 54 years. There have been six Congress Prime Ministers, the first being Jawaharlal Nehru (1947–1964), and the most recent Manmohan Singh (2004–2014).\nAfter Indian independence, the Congress emerged as a catch-all party under Nehru, dominating Indian politics for the next 20 years. During this time, the Congress generally advocated socialist policies, and established a secular state. After Nehru's death and the short tenure of Lal Bahadur Shastri, Indira Gandhi became the leader of the party. During her tenure, the Congress shifted to the left.\nIn 1969, the party suffered a major split, with a faction led by Indira Gandhi leaving to form the Congress (R), leaving the remainder as the Congress (O). The Congress (R) became the dominant faction, winning a strong victory in the 1971 Indian general election. However, backlash against the Emergency and the uniting of several opposition parties into the Janata Party led to the Congress being defeated in the 1977 Indian general election. Another split occurred in 1979, leading to the creation of the Congress (I), which was recognised as the Congress by the Electoral Commission in 1981.\nIn 1984, Indira Gandhi was assassinated, and was succeeded as president by her son, Rajiv Gandhi. Under his leadership, the party won a massive victory in 1984, but lost power in 1989 to the National Front under V. P. Singh. The Congress then returned to power under P. V. Narasimha Rao, who moved the party towards an economically liberal agenda, a sharp break from previous leaders. However, it lost the 1996 general election, and was replaced in government by the National Front and then the Bharatiya Janata Party.\nThe Congress party won the 2004 general elections and returned to power after a record eight years out of office. The Congress-led coalition known as the United Progressive Alliance (UPA) under Manmohan Singh formed a government. Subsequently, the UPA again formed the government after winning the 2009 general elections, and Singh became the first Prime Minister since Nehru in 1962 to be re-elected after completing a full five-year term. However, in the 2014 general election, the Congress suffered a heavy defeat winning only 48 seats of the 543-member Lok Sabha (the lower house of the Parliament of India). As of June 2021, the party with its alliances is in power in six legislative assemblies.\nA total of 61 people have served as the president of the INC since its formation. Sonia Gandhi is the longest serving president of the party, having held the office for over twenty years from 1998 to 2017 and since 2019. The district party is the smallest functional unit of the Congress. There is also a Pradesh Congress Committee (PCC), present at the state-level in every state. Together, the delegates from  the districts and PCCs form the All India Congress Committee (AICC). The party is also organized into several committees, and sections."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Matchmaking",
    "content": "Indian Matchmaking is a 2020 Indian documentary television series produced by Smriti Mundhra that premiered on Netflix on July 16, 2020. In August 2021, Netflix renewed the series for a second season."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_rupee",
    "content": "The Indian rupee (symbol: ₹; code: INR) is the official currency of India. The rupee is subdivided into 100 paise (singular: paisa), though as of 2019, coins of denomination of 1 rupee is the lowest value in use. The issuance of the currency is controlled by the Reserve Bank of India. The Reserve Bank manages currency in India and derives its role in currency management on the basis of the Reserve Bank of India Act, 1934.\nIn 2010, a new rupee sign (₹) was officially adopted. It was derived from the combination of the Devanagari consonant \"र\" (ra) and the Latin capital letter \"R\" without its vertical bar (similar to the R rotunda). The parallel lines at the top (with white space between them) are said to make an allusion to the tricolour Indian flag, and also depict an equality sign that symbolises the nation's desire to reduce economic disparity. The first series of coins with the new rupee sign started in circulation on 8 July 2011. Before this, India used \"₨\" and \"Re\" as the symbols for multiple rupees and one rupee, respectively.\nOn 8 November 2016, the Government of India announced the demonetisation of ₹500 and ₹1,000 banknotes with effect from midnight of the same day, making these notes invalid. A newly redesigned series of ₹500 banknote, in addition to a new denomination of ₹2,000 banknote is in circulation since 10 November 2016.From 2017 to 2019 the remaining banknotes of the Mahatma Gandhi New Series were released in denominations of ₹10, ₹20, ₹50, ₹100 and ₹200. The ₹1,000 note has been suspended.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_people",
    "content": "Indians are the nationals and citizens of India, the second most populous nation in the world, containing 17.50% of the world's population. In India, the term \"Indian\" refers to nationality, rather than a particular ethnicity or language; the Indian nationality consists of dozens of regional ethno-linguistic groups, reflecting the rich and complex history of the region. Due to emigration, the Indian diaspora is present throughout the world, notably in other parts of Asia, North America, Europe, the Caribbean, Oceania, and Africa. The demonym Indian applies to nationals of the present-day Republic of India, but also to people residing outside of India, who are called Overseas Indians; before the partition of India in 1947, the demonym applied to all nationals residing in the entirety of British India (including what is now Pakistan and Bangladesh).In Canada, the Caribbean, and the United States, the terms Asian Indian and East Indian are sometimes used to avoid confusion with First Nations in Canada, the indigenous people of the Caribbean, and Native Americans in the U.S., which are also commonly known as \"Indian\"."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Historical_Roasts",
    "content": "Historical Roasts is an American comedy television series on Netflix. Based on the Los Angeles live comedy show of the same name, the series \"roasts\" historical figures including Abraham Lincoln, Martin Luther King Jr., and Cleopatra. The 6-episode first season was released on Netflix on May 27, 2019. It is hosted by Jeff Ross, a \"recurring roaster\" who has appeared frequently in stand-up specials and series on Comedy Central."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Kappalottiya_Thamizhan",
    "content": "Kappalottiya Thamizhar (transl. The Tamilian who launched a ship) is a 1961 Indian Tamil-language historical drama film produced and directed by B. R. Panthulu. The film stars Sivaji Ganesan, Gemini Ganesan and Savitri. It is based on the 1944 book of the same name by M. P. Sivagnanam, a biography of V. O. Chidambaram Pillai who founded the Swadeshi Stream Navigation Company to break the monopoly of the British over maritime trade out of India.\nKappalottiya Thamizhan was released on 7 November 1961. The film received critical acclaim, and won the National Film Award for Best Feature Film in Tamil at the 9th National Film Awards. Though it performed poorly at the box office during its initial release, it fared better after receiving tax exemption during its re-release 1967."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Ocean_Dipole",
    "content": "The Indian Ocean Dipole (IOD), also known as the Indian Niño, is an irregular oscillation of sea surface temperatures in which the western Indian Ocean becomes alternately warmer (positive phase) and then colder (negative phase) than the eastern part of the ocean.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/American_Association_of_Physicians_of_Indian_Origin",
    "content": "The American Association of Physicians of Indian Origin (AAPI) is a professional association for Indian American physicians.\nThe association is based in Chicago and was founded in 1984. As of 2019, it claims a membership of 80,000 physicians.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Prime_Minister_of_India",
    "content": "The prime minister of India (IAST: Bhārat ke Pradhānamantrī) is the de facto head of the government of India. The prime minister is the presiding member of the Council of Ministers of the central government and heads the federal cabinet. They can be a member of any of the two houses of the Parliament of India—the Lok Sabha and the Rajya Sabha. The prime minister ranks third in the order of precedence.\nThe prime minister is appointed by the President of India; however the prime minister has to enjoy the confidence of the majority of Lok Sabha members who are directly elected every five years lest they shall resign.\nThe prime minister is the senior-most member of the Council of Ministers of the Union government. The prime minister unilaterally controls the selection and dismissal of members of the Council; and allocation of posts to members within the government. This Council assists the President regarding the operations under the latter's powers; however, by the virtue of Article 74, such 'aid and advice' tendered by the Council is binding. The Council is collectively responsible to the Lok Sabha as per Article 75(3) of the Constitution.\nThe de facto commander-in-chief of the armed forces, the prime minister is usually the most powerful person in India and one of so in the world. Because they are the Leader of the Lok Sabha by default and India is a parliamentary system, the prime minister is the largest influencer over the legislature. Their advice to the president regarding top-level appointments carries the largest weightage.\nNarendra Modi is the 14th and current prime minister of India, having assumed office on 26 May, 2014.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_historical_films_set_in_Asia",
    "content": "Historical or period drama is a film genre in which stories are based on historical events and famous persons. Some historical dramas attempt to accurately portray a historical event or biography, to the degree that the available historical research will allow. Other historical dramas are fictionalised tales that are based on an actual person and their deeds.\nDue to the sheer volume of films included in this genre and in the interest of continuity, this list is primarily focused on films pertaining to the history of East Asia, Central Asia, and India. For films pertaining to the history of Near Eastern and Western civilisation, please refer to list of historical period drama films and series set in Near Eastern and Western civilization.\nThe films on this page are divided into regions, and within each region the films are listed chronologically by subject matter."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Carlisle_Indian_Industrial_School",
    "content": "The United States Indian Industrial School in Carlisle, Pennsylvania, generally known as Carlisle Indian Industrial School, was the flagship Indian boarding school in the United States from 1879 through 1918. It took over the historic Carlisle Barracks, which was transferred to the Department of Interior from the War Department. After the United States entry into World War I, the school was closed and this property was transferred back to the Department of Defense. All the property is now part of the U.S. Army War College.\nFounded in 1879 under U.S. governmental authority by Lieutenant Richard Henry Pratt, Carlisle was one of the early federally funded off-reservation Indian boarding schools. The Choctaw Academy at Great Crossings, Kentucky was the first. In his own words, Pratt's motto was, \"Kill the Indian, save the man;\" a mentality which was then applied to the cultural assimilation efforts of the larger American Indian boarding school system  Pratt wrote that he believed that Native Americans were 'equal' to European-Americans, and that the School worked to immerse students into mainstream Euro-American culture, believing they might thus be able to advance and thrive in the dominant society, and be leaders to their people.After the government assessed the initial success of older Indian students at Hampton Normal and Agricultural School and some in upstate New York, who were former prisoners of war, Lieutenant  Pratt was authorized to establish the first all-Indian school, Carlisle, in 1879 at the historic Carlisle Barracks in central Pennsylvania. The property was transferred from the War Department to the Department of Interior for this purpose.\nAs at Hampton, arriving students were shorn of their long hair, and even their names were changed. However, \"unlike Hampton, whose purpose was to return assimilated educated Indians to their people, Carlisle meant to turn the school into the ultimate Americanizer\". At Carlisle, Pratt established a highly structured, quasi-military regime. He was known to use corporal punishment (which was not uncommon in society at the time) on students who exhibited Native behavior, so that they would rely only on themselves.Carlisle became the model for 26 off-reservation Bureau of Indian Affairs boarding schools in 15 states and territories. Some private boarding schools were sponsored by religious denominations. It has been designated as a National Historic Landmark. In addition, the government operated a total of more than 300 schools on reservations, many of which accepted boarding students from other tribes.\nFrom 1879 until 1918, more than 10,000 Native American children from 140 tribes attended Carlisle.  The school's 1911 Annual Report included the results of an employment survey of 532 graduates and 3619 other ex-students. Tribes with the largest number of students included the Lakota, Ojibwe, Cherokee, Apache, Cheyenne, Alaska Native, and Iroquois Seneca and Oneida. The Carlisle Indian School exemplified Progressive Era values. Some believed Carlisle provided an excellent education.\n\nThe policies of the government and practices of Carlisle and similar schools have been controversial since the late 20th century. Some have condemned Pratt's views on assimilation."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Lists_of_21st-century_earthquakes",
    "content": "The following is a summary of significant earthquakes during the 21st century.\nIn terms of fatalities, the 2004 Indian Ocean earthquake was the most destructive event with around 227,898 fatalities, followed by the 2010 Haiti earthquake with 160,000 fatalities, 2005 Kashmir earthquake 87,351 fatalities  and 2008 Sichuan earthquake with 87,587 fatalities. \nThe 2011 Tōhoku earthquake and tsunami became the costliest natural disaster, resulting in approximately $360 billion in property damage at the time, followed by the 2008 Sichuan earthquake which resulted at least $150 billion in damage."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Canadian_Indian_residential_school_system",
    "content": "In Canada, the Indian residential school system was a network of boarding schools for Indigenous peoples. Attendance was mandatory from 1894 to 1947. The network was funded by the Canadian government's Department of Indian Affairs and administered by Christian churches. The school system was created to isolate Indigenous children from the influence of their own native culture and religion in order to assimilate them into the dominant Canadian culture.: 42  Over the course of the system's more than hundred-year existence, around 150,000 children were placed in residential schools nationally.: 2–3  By the 1930s about 30 percent of Indigenous children were believed to be attending residential schools. The number of school-related deaths remains unknown due to incomplete records. Estimates range from 3,200 to over 30,000.The system had its origins in laws enacted before Confederation, but it was primarily active from the passage of the Indian Act in 1876, under Prime Minister Alexander MacKenzie. Under Prime Minister John A. Macdonald, the government adopted the residential industrial school system of the United States, a partnership between the government and various church organizations. An amendment to the Indian Act in 1894, under Prime Minister Mackenzie Bowell, made attendance at day schools, industrial schools, or residential schools compulsory for First Nations children. Due to the remote nature of many communities, school locations meant that for some families, residential schools were the only way to comply. The schools were intentionally located at substantial distances from Indigenous communities to minimize contact between families and their children. Indian Commissioner Hayter Reed argued for schools at greater distances to reduce family visits, which he thought counteracted efforts to assimilate Indigenous children. Parental visits were further restricted by the use of a pass system designed to confine Indigenous peoples to reserves. The last federally-funded residential school, Kivalliq Hall in Rankin Inlet, closed in 1997. Schools operated in every province and territory with the exception of New Brunswick and Prince Edward Island.\nThe residential school system harmed Indigenous children significantly by removing them from their families, depriving them of their ancestral languages, and exposing many of them to physical and sexual abuse. Students were also subjected to forced enfranchisement as \"assimilated\" citizens that removed their legal identity as Indians. Disconnected from their families and culture and forced to speak English or French, students who attended the residential school system often graduated being unable to fit into their communities but remaining subject to racist attitudes in mainstream Canadian society. The system ultimately proved successful in disrupting the transmission of Indigenous practices and beliefs across generations. The legacy of the system has been linked to an increased prevalence of post-traumatic stress, alcoholism, substance abuse, and suicide, which persist within Indigenous communities today.While religious communities issued their first apologies for their respective roles in the residential school system in the late 1980s and early 1990s, on June 11, 2008, Prime Minister Stephen Harper offered the first public apology on behalf of the Government of Canada and the leaders of the other federal parties in the House of Commons. Nine days prior, the Truth and Reconciliation Commission (TRC) was established to uncover the truth about the schools. The commission gathered about 7,000 statements from residential school survivors through public and private meetings at various local, regional and national events across Canada. Seven national events held between 2008 and 2013 commemorated the experience of former students of residential schools. In 2015, the TRC concluded with the establishment of the National Centre for Truth and Reconciliation, and the publication of a multi-volume report detailing the testimonies of survivors and historical documents from the time. The TRC report concluded that the school system amounted to cultural genocide. In 2021, over a thousand unmarked graves were discovered on the grounds of former residential schools."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Coins_of_the_Indian_rupee",
    "content": "Coins of the Indian rupee (INR) were first minted in 1950. New coins have been produced annually since then and they make up a valuable aspect of the Indian currency system. Today, circulating coins exist in denominations of One Rupee, Two Rupees, Five Rupees, Ten Rupees and Twenty Rupees. All of these are produced by four mints located across India, in Kolkata, Mumbai, Hyderabad, Noida.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_National_Army",
    "content": "The Indian National Army (INA; Azad Hind Fauj ; lit. 'Free Indian Army') was an armed force formed by Indian freedom fighters/collaborators and Imperial Japan on 1 September 1942 in Southeast Asia during World War II. Its aim was to secure Indian independence from British rule. It fought alongside Japanese soldiers in the latter's campaign in the Southeast Asian theatre of WWII. The army was first formed in 1942 under Captain Mohan Singh by Indian PoWs of the British-Indian Army captured by Japan in the Malayan campaign and at Singapore. This first INA,which had been handed over to Rash Behari Bose, collapsed and was disbanded in December that year after differences between the INA leadership and the Japanese military over its role in Japan's war in Asia. Rash Behari Bose handed over INA to Subhas Chandra Bose. It was revived under the leadership of Subhas Chandra Bose after his arrival in Southeast Asia in 1943. The army was declared to be the army of Bose's Arzi Hukumat-e-Azad Hind (the Provisional Government of Free India). Netaji Subhas Chandra Bose named the brigades/regiments of INA after Gandhi, Nehru, Maulana Azad, and himself. There was also an all-women regiment named after Rani of Jhanshi, Lakshmibai. Under Bose's leadership, the INA drew ex-prisoners and thousands of civilian volunteers from the Indian expatriate population in Malaya (present-day Malaysia) and Burma. This second INA fought along with the Imperial Japanese Army against the British and Commonwealth forces in the campaigns in Burma: at Imphal and Kohima, and later against the Allied retaking of Burma.After the INA's initial formation in 1942, there was concern in the British-Indian Army that further Indian troops would defect. This led to a reporting ban and a propaganda campaign called \"Jiffs\" to preserve the loyalty of the Sepoy. Historians like Peter W. Fay who have written about the army, however, consider the INA not to have had significant influence on the war. The end of the war saw many of the troops repatriated to India where some faced trials for treason. These trials became a galvanising point in the Indian Independence movement. The Bombay mutiny in the Royal Indian Navy and other mutinies in 1946 are thought to have been caused by the nationalist feelings that were caused by the INA trials. Historians like Sumit Sarkar, Peter Cohen, Fay and others suggest that these events played a crucial role in hastening the end of British rule. A number of people associated with the INA during the war later went on to hold important roles in public life in India as well as in other countries in Southeast Asia, most notably Lakshmi Sehgal in India, and John Thivy and Janaki Athinahappan in Malaya.It was associated with Imperial Japan and the other Axis powers, and accusations were levelled against INA troops of being involved and complicit in Japanese war crimes. The INA's members were viewed as Axis collaborators by British soldiers and Indian PoWs who did not join the army, but after the war they were seen as patriots by many Indians. Although they were widely commemorated by the Indian National Congress in the immediate aftermath of Indian independence, members of the INA were denied freedom fighter status by the Government of India, unlike those in the Gandhian movement. Nevertheless, the army remains a popular and passionate topic in Indian culture and politics."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Multi-sport_event",
    "content": "A multi-sport event is an organized sporting event, often held over multiple days, featuring competition in many different sports among organized teams of athletes from (mostly) nation-states. The first major, modern, multi-sport event of international significance was the  Olympic Games, first held in modern times in 1896 in Athens, Greece and inspired by the Ancient Olympic Games, one of a number of such events held in antiquity. Most modern multi-sports events have the same basic structure. Games are held over the \ncourse of several days in and around a \"host city\", which changes for each competition. Countries send national teams to each competition, consisting of individual athletes and teams that compete in a wide variety of sports.  Athletes or teams are awarded gold, silver or bronze medals for first, second and third place respectively. Each games are generally held every four years, though some are annual competitions."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Plate",
    "content": "The Indian Plate or India Plate is a minor tectonic plate straddling the Equator in the Eastern Hemisphere. Originally a part of the ancient continent of Gondwana, India broke away from the other fragments of Gondwana 100 million years ago and began moving north. Once fused with the adjacent Australian Plate to form a single Indo-Australian Plate, recent studies suggest that India and Australia have been separate plates for at least 3 million years and likely longer.  The Indian Plate includes most of South Asia—i.e. the Indian subcontinent—and a portion of the basin under the Indian Ocean, including parts of South China and western Indonesia, and extending up to but not including Ladakh, Kohistan and Balochistan."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Non-resident_Indian_and_Overseas_Citizen_of_India",
    "content": "Overseas Indians, officially known as Non-Resident Indians (NRIs) or Overseas Citizen of India (OCIs), are people of Indian birth or ancestry who live outside the Republic of India. According to a Ministry of External Affairs report, there are 32 million NRIs and OCIs residing outside India and overseas Indians comprise world's largest overseas diaspora. Every year 2.5 million (25 lakhs) Indians migrate overseas, which is the highest annual number of migrants in the world.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Mughal-e-Azam",
    "content": "Mughal-e-Azam (transl. The Great Mughal) is a 1960 Indian epic historical drama film directed by K. Asif and produced by Shapoorji Pallonji. Starring Prithviraj Kapoor, Madhubala, Durga Khote and Dilip Kumar, it follows the love affair between Mughal Prince Salim (who went on to become Emperor Jahangir) and Anarkali, a court dancer. Salim's father, Emperor Akbar, disapproves of the relationship, which leads to a war between father and son.\nThe development of Mughal-e-Azam began in 1944, when Asif read a 1922 play called Anarkali which is set in the reign of Emperor Akbar (1556–1605). Production was plagued by delays and financial uncertainty. Before its principal photography began in the early 1950s, the project had lost a financier and undergone a complete change of cast. Mughal-e-Azam cost more to produce than any previous Indian motion picture; the budget for a single song sequence exceeded that typical for an entire film of the period. The soundtrack, inspired by Indian classical and folk music, comprises 12 songs voiced by playback singer Lata Mangeshkar along with Mohammed Rafi, Shamshad Begum and classical singer Bade Ghulam Ali Khan, and is often cited among the finest in Bollywood cinematic history.\nMughal-e-Azam had the widest release of any Indian film up to that time, and patrons often queued all day for tickets. Released on 5 August 1960, it broke box office records in India and became the highest-grossing Indian film of all time, a distinction it held for 15 years; adjusted for inflation, it may still be the highest grossing Indian film of all time. The accolades awarded to the film include one National Film Award and three Filmfare Awards at the 8th Filmfare Awards. Mughal-e-Azam was the first black-and-white Hindi film to be digitally coloured, and the first in any language to be given a theatrical re-release. The colour version, released on 12 November 2004, was also a commercial success.\nThe film is widely considered to be a milestone of its genre, earning praise from critics for its grandeur and attention to detail, and the performances of its cast (especially that of Madhubala, who earned a nomination for the Filmfare Award for Best Actress). Film scholars have welcomed its portrayal of enduring themes, but question its historical accuracy."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Malliswari_(1951_film)",
    "content": "Malliswari is a 1951 Indian Telugu-language historical romance film produced and directed by B. N. Reddy under his banner Vauhini Studios. N. T. Rama Rao and P. Bhanumathi  star as a couple – Nagaraju and Malliswari – who are separated by Malliswari's greedy mother. Malliswari is sent to the king's palace according to the custom of \"Rani Vasam\", a tradition during the Vijayanagara Empire wherein young women were fetched to the palace with an offering gold and jewellery to their parents. The rest of the film focuses on the consequences faced by Nagaraju when he, against all rules, surreptitiously enters the palace to meet Malliswari.\nReddy wanted to make a film based on Krishnadevaraya's character ever since his visit to Hampi for the filming of his debut Vandemataram (1939). He employed Devulapalli Krishnasastri to write the film's script and took inspiration from Buchibabu's play \"Rayalavari Karunakruthyamu\" and Devan Sharar's short story \"The Emperor and the Slave Girl\". He also incorporated into the script a few incidents from his childhood for the pranks between Nagaraju and Malliswari. S. Rajeswara Rao composed the film's music, Adi M. Irani and B. N. Konda Reddy provided the cinematography, H. R. Narayana and Vasu edited the film, and A. K. Shekhar was the film's production designer.\nThe production phase of Malliswari lasted for two years and the film was released on 20 December 1951. It opened to a tepid response at the box office, but soon saw a growth in ticket sales due to favourable word of mouth. It grossed over ₹8 lakh (₹0.8 million) and was commercially successful. Malliswari was later screened at the 9th International Film Festival of India and the 1952 Peking film festival, making it the first Telugu film to be screened in an international film festival. B. N. Reddy planned to dub the film into English, but backed out due to budget considerations.\nMalliswari achieved cult status in Telugu cinema and is considered one of the best works of Reddy as a filmmaker. It became the first film script to be serialised in the magazine Vijayachitra, and a few universities in the United States wished to have the film's script as a part of their textual studies. On the centenary of Indian cinema in April 2013, CNN-IBN included Malliswari in its list, \"The 100 greatest Indian films of all time\"."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Institute_of_Science",
    "content": "The Indian Institute of Science (IISc) is a public, deemed, research university for higher education and research in science, engineering, design, and management. It is located in Bengaluru, in the Indian state of Karnataka. The institute was established in 1909 with active support from Jamsetji Tata and thus is also locally known as the \"Tata Institute\". It is ranked among the most prestigious academic institutions in India and has the highest citation per faculty among all the universities in the world. It was granted the deemed to be university status in 1958 and the Institute of Eminence status in 2018.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Islam_in_India",
    "content": "Islam is the second-largest religion in India, with 14.9% of the country's population, approximately 195 million people identifying as adherents of Islam in 2015. India is the country with the second or third largest number of Muslims in the world. The majority of Indian Muslims belong to the Sunni sect of Islam, while the Shia form a sizeable minority. Islam existed in Indian communities along the Arab coastal trade routes in Gujarat, and Malabar as soon as the religion originated and had gained early acceptance in the Arabian Peninsula. \nThe Barwada Mosque in Ghogha, Gujarat built before 623 CE, Cheraman Juma Mosque (629 CE) in Methala, Kerala and Palaiya Jumma Palli (or The Old Jumma Masjid - 628 - 630 CE) in Kilakarai, Tamil Nadu are three of the first mosques in India which were built by seafaring Arab merchants. According to the Legend of Cheraman Perumals, the first Indian mosque was built in 624 AD at Kodungallur in present-day Kerala with the mandate of the last the ruler (the Cheraman Perumal) of Chera dynasty, who converted to Islam during the lifetime of Prophet Muhammad (c. 570–632). On a similar note, Tamil Muslims on the eastern coasts also claim that they converted to Islam in Muhammad's lifetime. The local mosques date to the early 700s."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Sport_in_India",
    "content": "Sports in India refers to the large variety of games played in India, ranging from tribal games to more mainstream sports such as field hockey, kabaddi, cricket, badminton and football. India's diversity of culture, people, and tribes are reflected in the wide variety of sporting disciplines in the country.\nCricket is the most popular sport in India, the country has hosted and won the Cricket World Cup on multiple occasions. Field hockey is the most successful sport for India at the Olympic Games; the Indian men's team have won thirteen Olympic medals including eight gold medals. Other popular sports in India are badminton, football, shooting, wrestling, boxing, tennis, squash, weightlifting, gymnastics, athletics, table tennis, basketball, volleyball, and cycling. Popular indigenous sports include chess, kho-kho, kite-fighting, leg cricket, polo, snooker, and gillidanda.\nKabaddi is an ancient sport and one of the fastest growing sports of India. India won many matches and seasons of kabaddi at the Asian Games and all three seasons of the Kabaddi World Cup (Standard style). \nIndia has hosted and co-hosted several international sporting events, most notably the 1987, 1996 and 2011 Cricket World Cups, the 1951 and 1982 Asian Games, the 2010 Commonwealth Games, and the 2017 FIFA U-17 World Cup.\nDomestic professional sports leagues in the country include the Indian Premier League (Twenty20 cricket), the I-League and the Indian Super League (football), the Pro Kabaddi League (kabaddi), the Hockey India League (hockey), Premier Badminton League (badminton), the Pro Wrestling League (wrestling), the Ultimate Table Tennis league (table tennis), and the Pro Volleyball League (volleyball). The Ultimate Kho-Kho League is expected to launch in 2020, having attracted a major sponsorship deal with Dabur.\nMajor international sporting events annually held in India include the Chennai Open in tennis, the Indian Open in golf, and the India Open in badminton.\nThe Major Dhyan Chand Khel Ratna is India's highest award for achievement in sports, while the Dronacharya Award is awarded for excellence in coaching."
  },
  {
    "url": "https://en.wikipedia.org/wiki/The_Battle_of_Bhima_Koregaon_(film)",
    "content": "The Battle of Bhima Koregaon is an upcoming Indian Hindi-language period war drama film directed and produced by Ramesh Thete under his banner Ramesh Thete Films. It depicts the events that took place during the Battle of Koregaon. The film stars Arjun Rampal as a Mahar warrior Sidhnak Inamdar, and Digangana Suryavanshi."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Tamil_historical_novels",
    "content": "Tamil historical novels are a genre of Tamil literature that began to appear in the mid-19th century.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Historiography",
    "content": "Historiography is the study of the methods of historians in developing history as an academic discipline, and by extension is any body of historical work on a particular subject. The historiography of a specific topic covers how historians have studied that topic using particular sources, techniques, and theoretical approaches. Scholars discuss historiography by topic—such as the historiography of the United Kingdom, that of WWII, the British Empire, early Islam, and China—and different approaches and genres, such as political history and social history. Beginning in the nineteenth century, with the development of academic history, there developed a body of historiographic literature. The extent to which historians are influenced by their own groups and loyalties—such as to their nation state—remains a debated question.In the ancient world, chronological annals were produced in civilizations such as ancient Egypt and Mesopotamia. However, the discipline of historiography was first established in the 5th century BC with the Histories of Herodotus, the founder of historiography. The Roman statesman Cato the Elder produced the first history in Latin, the Origines, in the 2nd century BC. His near contemporaries Sima Tan and Sima Qian in the Han Empire of China established Chinese historiography with the compiling of the Shiji (Records of the Grand Historian). During the Middle Ages, medieval historiography included the works of chronicles in medieval Europe, Islamic histories by Muslim historians, and the Korean and Japanese historical writings based on the existing Chinese model. During the 18th-century Age of Enlightenment, historiography in the Western world was shaped and developed by figures such as Voltaire, David Hume, and Edward Gibbon, who among others set the foundations for the modern discipline.\nThe research interests of historians change over time, and there has been a shift away from traditional diplomatic, economic, and political history toward newer approaches, especially social and cultural studies. From 1975 to 1995 the proportion of professors of history in American universities identifying with social history increased from 31 to 41 percent, while the proportion of political historians decreased from 40 to 30 percent. In 2007, of 5,723 faculty in the departments of history at British universities, 1,644 (29 percent) identified themselves with social history and 1,425 (25 percent) identified themselves with political history.  Since the 1980s there has been a special interest in the memories and commemoration of past events—the histories as remembered and presented for popular celebration."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_School_of_Business",
    "content": "The Indian School of Business (ISB) is a private business school established in India in 2001. It has two parallel campuses in India, in Hyderabad (Telangana) and Mohali (Punjab). It offers certificates in various post-graduate management programs. ISB became the 100th Triple Accredited business school in the world (AMBA, EQUIS, AACSB) upon achieving AMBA accreditation on 12 May 2020.ISB is currently the highest ranked business school from India in Forbes, Financial Times, Economist, Poets&Quants and Bloomberg Businesssweek Global MBA Rankings"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Chandralekha_(1998_film)",
    "content": "Chandralekha is a 1998 Indian Telugu-language comedy drama film, produced by Nagarjuna and V. Ram Prasad under the  Great India Enterprises banner and directed by Krishna Vamsi. It stars Nagarjuna Akkineni, Ramya Krishna and Isha Koppikar, with music composed by Sandeep Chowtha. This film is a remake of the Mohanlal-starring Malayalam film  Chandralekha, directed by Priyadarshan. It is the second combination of Nagarjuna-Vamsi-Chowtha after Ninne Pelladata. Bollywood actor Sanjay Dutt made a special appearance for the first time in a Telugu film."
  },
  {
    "url": "https://en.wikipedia.org/wiki/22_June_1897",
    "content": "22 June 1897 is a 1979 Marathi film co-written by Shankar Nag and Nachiket Patwardhan and directed by the husband and wife team of Jayoo Patwardhan and Nachiket Patwardhan. The duo are also practising architects. It is based on the true life story of the assassination of British Government officers Walter Charles Rand ICS and Lt. Charles Egerton Ayerst by the Chapekar brothers.\nThe film has been included in the book One Hundred Indian Feature Films: An Annotated Filmography, a representative selection from the first Indian talkies to the then-present date (1988). The title of the film is the date of the assassination, 22 June 1897. It won the 1980 Indian Silver Lotus at the National Film Awards in two categories: Best film on National Integration and Art Direction. It also won the 1980 Maharashtra State awards for best film of the year and best director. The film has been included in the selected collection of Indian films and videos in the US Library of Congress. Most of the performers in the film then belonged to Theatre Academy, Pune."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Guru_Da_Banda",
    "content": "Guru Da Banda is a 2018 Indian Punjabi-language animated historical drama film about Banda Singh Bahadur directed by Jassi Chana. Produced by Joginder Singh Bhangalia and Sonu Bhangalia under the banner Pritam Films Production, the film was released on 24 August 2018."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Airlift_(film)",
    "content": "Airlift is a 2016 Indian Hindi-language historical drama film directed by Raja Krishna Menon starring Akshay Kumar and Nimrat Kaur, that follows Ranjit Katyal (played by Kumar), a Kuwait-based businessman as he carries out the evacuation of Indians based in Kuwait during the Invasion of Kuwait by Saddam Hussein's Iraq. The film was jointly produced by Abundantia Entertainment, Cape of Good Films, Emmay Entertainment, Hari Om Entertainment, T-Series and Viacom 18 Motion Pictures on a total budget of ₹320 million. The plot is adapted from real life story of a Kuwait-based Malayali businessman Mathunny Mathews.Airlift opened theatrically worldwide on 22 January 2016, coinciding with Republic Day weekend. Its marketing played an important role in promotion, and collaboration with the flight company Air India who had a major contribution in the evacuation of record-breaking number of Indians during the war. The film emerged as a blockbuster at Indian as well as abroad box office. Airlift has grossed over ₹2.28 billion in global markets and gained awards for its background score and cast performances, notably one Zee Cine Award. The film is featured among the 2016 Indian Panorama section of the International Film Festival of India."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_National_Army_trials",
    "content": "The Indian National Army trials (also known as the INA trials and the Red Fort trials) was the British Indian trial by court-martial of a number of officers of the Indian National Army (INA) between November 1945 and May 1946, on various charges of treason, torture, murder and abetment to murder, during the Second World War. In total, approximately ten court-martials were held.  The first of these was the joint court-martial of Colonel Prem Sahgal, Colonel Gurbaksh Singh Dhillon, and Major-General Shah Nawaz Khan. The three had been officers in the British Indian Army and were taken prisoner in Malaya, Singapore and Burma. They had, like a large number of other troops and officers of the British Indian Army, joined the Indian National Army and later fought in Burma alongside the Japanese military under the Azad Hind. \nThese three came to be the only defendants in the trials who were charged with \"waging war against the King-Emperor\" (the Indian Army Act, 1911 did not provide for a separate charge for treason) as well as murder and abetment of murder.  Those charged later only faced trial for torture and murder or abetment of murder. The trials covered arguments based on military law, constitutional law, international law, and politics. Historian Mithi Mukherjee has called the event of the trial \"a key moment in the elaboration of an anticolonial critique of international law in India.\" As it was an army trial, Lt. Col. Horilal Varma Bar At Law & the then-Prime Minister of the Rampur State, along with Tej Bahadur Sapru, served as the lawyers for the defendants. These trials attracted much publicity, and public sympathy for the defendants, particularly as India was in the final stages of the Indian independence movement. Outcry over the grounds of the trial, as well as a general emerging unease and unrest within the troops of the Raj, ultimately forced the then-Army Chief Field Marshal Claude Auchinleck to commute the sentences of the three defendants in the first trial."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Territory",
    "content": "The Indian Territory and the Indian Territories are terms that generally described an evolving land area set aside by the United States Government for the relocation of Native Americans who held aboriginal title to their land as a sovereign independent state. In general, the tribes ceded land they occupied in exchange for land grants in 1803. The concept of an Indian Territory was an outcome of the US federal government's 18th- and 19th-century policy of Indian removal. After the American Civil War (1861–1865), the policy of the US government was one of assimilation.\nThe term Indian Reserve describes lands the British set aside for Indigenous tribes between the Appalachian Mountains and the Mississippi River in the time before the American Revolutionary War (1775–1783).\nIndian Territory later came to refer to an unorganized territory whose general borders were initially set by the Nonintercourse Act of 1834, and was the successor to the remainder of the Missouri Territory after Missouri received statehood.  The borders of Indian Territory were reduced in size as various Organic Acts were passed by Congress to create incorporated territories of the United States.  The 1907 Oklahoma Enabling Act created the single state of Oklahoma by combining Oklahoma Territory and Indian Territory, ending the existence of an unorganized unincorporated independent Indian Territory as such. Before Oklahoma statehood, Indian Territory from 1890 onwards consisted of the Cherokee, Choctaw, Chickasaw, Creek and Seminole tribes and their territorial holdings.\nIndian reservations remain within the boundaries of US states, but largely exempt from state jurisdiction. The term Indian country is used to signify lands under the control of Native nations, including Indian reservations, trust lands on Oklahoma Tribal Statistical Area, or, more casually, to describe anywhere large numbers of Native Americans live."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Border_(1997_film)",
    "content": "Border is a 1997 Indian Hindi-language epic war film directed, produced and written by J. P. Dutta. Set during the Indo-Pakistani War of 1971, it is an adaptation of real life events that happened during the Battle of Longewala in 1971. The film stars an ensemble cast of Sunny Deol, Sunil Shetty, Akshaye Khanna, Jackie Shroff, Sudesh Berry, Puneet Issar and Kulbhushan Kharbanda. Tabu, Raakhee, Pooja Bhatt and Sharbani Mukherjee feature in supporting roles.\nBorder was Dutta's dream project. He had begun working on the film's script in September 1995 and completed it by April 1996. The film was mostly shot in Bikaner, Rajasthan. Some parts were also filmed in Jodhpur. One of the film's songs, \"Sandese Aate Hai\", sung by Sonu Nigam and Roop Kumar Rathod, became one of the most popular Hindi songs. The popularity of the song led several directors to offer Nigam for singing in their film's songs. Javed Akhtar wrote the lyrics of the songs while Anu Malik composed them. The song \"Mere Dushman Mere Bhai\" was sung by Hariharan.The film was released worldwide on 13 June 1997 with positive reviews from critics and garnered critical acclaim for its story, execution, scale, showing off the battle, direction, screenplay, performances and soundtrack. It opened to strong box office results, had a final domestic net total of ₹394 million (US$5.2 million) and was declared an all-time blockbuster by Box Office India. It also became the highest-grossing Hindi film of 1997 in India, but if according to worldwide, it was the second highest-grossing film of the year behind Dil To Pagal Hai. Border grossed a worldwide total of ₹555.7 million (US$7.4 million).\nThe film won several awards at different award functions. It received 11 nominations at the 43rd Filmfare Awards, including Best Film, Best Actor for Sunny Deol, Best Supporting Actor for Suniel Shetty and Akshaye Khanna, and Best Supporting Actress for Raakhee, winning four including Best Male Debut for Akshaye Khanna. It also won three National Film Awards: Best Film on National Integration, Best Lyricist for Javed Akhtar, and Best Playback Singer (Male) for Hariharan.\nOn 15 August 2017, commemorating with the 70th Indian Independence Day, the Indian Directorate of Film Festivals and Ministry of Defence jointly presented the Independence Day Film Festival, where the film was screened retrospectively for its continued cult classical popularity and completion of 20 years."
  },
  {
    "url": "https://en.wikipedia.org/wiki/2004_Indian_Ocean_earthquake_and_tsunami",
    "content": "The 2004 Indian Ocean earthquake and tsunami (also known as the Boxing Day Tsunami and, by the scientific community, the Sumatra–Andaman earthquake) occurred at 07:58:53 local time (UTC+7) on 26 December, with an epicentre off the west coast of northern Sumatra, Indonesia. It was an undersea megathrust earthquake that registered a magnitude of 9.1–9.3 Mw, reaching a Mercalli intensity up to IX in certain areas. The earthquake was caused by a rupture along the fault between the Burmese Plate and the Indian Plate.\nA series of massive tsunami waves grew up to 30 m (100 ft) high once heading inland, after being created by the underwater seismic activity offshore. Communities along the surrounding coasts of the Indian Ocean were devastated, and the tsunamis killed an estimated 227,898 people in 14 countries, making it one of the deadliest natural disasters in recorded history. The direct results caused major disruptions to living conditions and commerce in coastal provinces of surrounded countries, including Aceh (Indonesia), Sri Lanka, Tamil Nadu (India) and Khao Lak (Thailand). Banda Aceh reported the largest number of deaths.\nThe earthquake was the third-largest ever recorded, the largest in the 21st century and had the longest duration of faulting ever observed, between eight and ten minutes. It caused the planet to vibrate as much as 10 mm (0.4 in), and also remotely triggered earthquakes as far away as Alaska. Its epicentre was between Simeulue and mainland Sumatra. The plight of the affected people and countries prompted a worldwide humanitarian response, with donations totalling more than US$14 billion."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Economy_of_India",
    "content": "The economy of India is a middle income developing mixed economy. It is the world's sixth-largest economy by nominal GDP and the third-largest by purchasing power parity (PPP). According to the International Monetary Fund (IMF), on a per capita income basis, India ranked 145th by GDP (nominal) and 122th by GDP (PPP). From independence in 1947 until 1991, successive governments promoted protectionist economic policies, with extensive state intervention and economic regulation. This is characterised as dirigism, in the form of the License Raj. The end of the Cold War and an acute balance of payments crisis in 1991 led to the adoption of a broad economic liberalisation in India. Since the start of the 21st century, annual average GDP growth has been 6% to 7%, and from 2013 to 2018, India was the world's fastest growing major economy, surpassing China. Historically, India was the largest economy in the world for most of the two millennia from the 1st until the 19th century.The long-term growth perspective of the Indian economy remains positive due to its young population and corresponding low dependency ratio, healthy savings, and investment rates, increasing globalisation in India and integration into the global economy. The economy slowed in 2017, due to shocks of \"demonetisation\" in 2016 and the introduction of the Goods and Services Tax in 2017. Nearly 60% of India's GDP is driven by domestic private consumption. The country remains the world's sixth-largest consumer market. Apart from private consumption, India's GDP is also fueled by government spending, investment, and exports. In 2019, India was the world's ninth-largest importer and the twelfth-largest exporter. India has been a member of the World Trade Organization since 1 January 1995. It ranks 63rd on the Ease of doing business index and 68th on the Global Competitiveness Report. With 500 million workers, the Indian labour force was the world's second-largest as of 2019. India has one of the world's highest number of billionaires and extreme income inequality. Since India has a vast informal economy, barely 2% of Indians pay income taxes.During the 2008 global financial crisis the economy faced a mild slowdown. India undertook stimulus measures (both fiscal and monetary) to boost growth and generate demand. In subsequent years, economic growth revived. According to the 2017 PricewaterhouseCoopers (PwC) report, India's GDP at purchasing power parity could overtake that of the United States by 2050. According to the World Bank, to achieve sustainable economic development, India must focus on public sector reform, infrastructure, agricultural and rural development, removal of land and labour regulations, financial inclusion, spur private investment and exports, education, and public health.In 2020, India's ten largest trading partners were the United States, China, the United Arab Emirates (UAE), Saudi Arabia, Switzerland, Germany, Hong Kong, Indonesia, South Korea, and Malaysia. In 2019–20, the foreign direct investment (FDI) in India was $74.4 billion. The leading sectors for FDI inflows were the service sector, the computer industry, and the telecom industry. India has free trade agreements with several nations, including ASEAN, SAFTA, Mercosur, South Korea, Japan, and several others which are in effect or under negotiating stage.The service sector makes up 50% of GDP and remains the fastest growing sector, while the industrial sector and the agricultural sector employs a majority of the labor force. The Bombay Stock Exchange and National Stock Exchange are some of the world's largest stock exchanges by market capitalization. India is the world's sixth-largest manufacturer, representing 3% of global manufacturing output, and employs over 57 million people. Nearly 66% of India's population is rural, and contributes about 50% of India's GDP. It has the world's fourth-largest foreign-exchange reserves worth $634.965 billion. India has a high public debt with 86% of GDP, while its fiscal deficit stood at 9.5% of GDP. India's government-owned banks faced mounting bad debt, resulting in low credit growth.  Simultaneously, the NBFC sector has been engulfed in a liquidity crisis. India faces moderate unemployment, rising income inequality, and a drop in aggregate demand. India's gross domestic savings rate stood at 30.1% of GDP in FY 2019. In recent years, independent economists and financial institutions have accused the government of fudging various economic data, especially GDP growth.India’s GDP in Q1 FY22 (Rs 32.38 lakh crore) is nearly nine per cent below the Q1 FY20 level (Rs 35.67 lakh crore) in 2021.India is the world's largest manufacturer of generic drugs, and its pharmaceutical sector fulfills over 50% of the global demand for vaccines. The Indian IT industry is a major exporter of IT services with $191 billion in revenue and employs over four million people. India's chemical industry is extremely diversified and estimated at $178 billion. The tourism industry contributes about 9.2% of India's GDP and employs over 42 million people. India ranks second globally in food and agricultural production, while agricultural exports were $35.09 billion. The construction and real estate sector ranks third among the 14 major sectors in terms of direct, indirect, and induced effects in all sectors of the economy. The Indian textiles industry is estimated at $100 billion and contributes 13% of industrial output and 2.3% of India's GDP while employs over 45 million people directly. India's telecommunication industry is the world's second largest by the number of mobile phone, smartphone, and internet users. It is the world's 23th-largest oil producer and the third-largest oil consumer. The Indian automobile industry is the world's fifth-largest by production. India has retail market worth $1.17 trillion, which contributes over 10% of India's GDP. It also has one of the world's fastest growing e-commerce markets. India has the world's fourth-largest natural resources, with the mining sector contributing 11% of the country's industrial GDP and 2.5% of total GDP. It is also the world's second-largest coal producer, the second-largest cement producer, the second-largest steel producer, and the third-largest electricity producer."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Winter_Olympic_Games",
    "content": "The Winter Olympic Games (French: Jeux olympiques d'hiver) is a major international multi-sport event held once every four years for sports practiced on snow and ice. The first Winter Olympic Games, the 1924 Winter Olympics, were held in Chamonix, France. The modern Olympic Games were inspired by the ancient Olympic Games, which were held in Olympia, Greece, from the 8th century BC to the 4th century AD. Baron Pierre de Coubertin founded the International Olympic Committee (IOC) in 1894, leading to the first modern Summer Olympic Games in Athens, Greece in 1896. The IOC is the governing body of the Olympic Movement, with the Olympic Charter defining its structure and authority.\nThe original five Winter Olympic sports (consisting of nine disciplines) were bobsleigh, curling, ice hockey, Nordic skiing (consisting of the disciplines military patrol, cross-country skiing, Nordic combined, and ski jumping), and skating (consisting of the disciplines figure skating and speed skating). The Games were held every four years from 1924 to 1936, interrupted in 1940 and 1944 by World War II, and resumed in 1948. Until 1992, the Summer Olympic Games and the Winter Olympic Games were held in the same year, and in accordance with the 1986 decision by the IOC to place the Summer Olympic Games and the Winter Olympic Games on separate four-year cycles in alternating even-numbered years, the next Winter Olympic Games after 1992 were held in 1994.\nThe Winter Olympic Games have evolved since their inception. Sports and disciplines have been added and some of them, such as alpine skiing, luge, short track speed skating, freestyle skiing, skeleton, and snowboarding, have earned a permanent spot on the Olympic program. Some others, including curling and bobsleigh, have been discontinued and later reintroduced; others have been permanently discontinued, such as military patrol, though the modern Winter Olympic sport of biathlon is descended from it. Still others, such as speed skiing, bandy and skijoring, were demonstration sports but never incorporated as Olympic sports. The rise of television as a global medium for communication enhanced the profile of the Games. It generated income via the sale of broadcast rights and advertising, which has become lucrative for the IOC. This allowed outside interests, such as television companies and corporate sponsors, to exert influence. The IOC has had to address numerous criticisms over the decades like internal scandals, the use of performance-enhancing drugs by Winter Olympians, as well as a political boycott of the Winter Olympic Games. Countries have used the Winter Olympic Games as well as the Summer Olympic Games to proclaim the superiority of their political systems.\nThe Winter Olympic Games have been hosted on three continents by twelve countries. They have been held four times in the United States (1932, 1960, 1980, and 2002), three times in France (1924, 1968, and 1992) and twice each in Austria (1964 and 1976), Canada (1988 and 2010), Japan (1972 and 1998), Italy (1956 and 2006), Norway (1952 and 1994) and Switzerland (1928 and 1948). Also, the Winter Olympic Games have been held just once each in Germany (1936), Yugoslavia (1984), Russia (2014), and South Korea (2018). The IOC has selected Beijing, China, to host the 2022 Winter Olympics and the Italian cities of Milan and Cortina d'Ampezzo to host the 2026 Winter Olympics. As of 2018, no city in the Southern Hemisphere has applied to host the cold-weather-dependent Winter Olympic Games, which are held in February.\nAs of 2022, twelve countries have participated in every Winter Olympic Games – Austria, Canada, Finland, France, Great Britain, Hungary, Italy, Norway, Poland, Sweden, Switzerland and the United States. Six of these countries have won medals at every Winter Olympic Games – Austria, Canada, Finland, Norway, Sweden, and the United States. The only country to have won a gold medal at every Winter Olympic Games is the United States. Norway leads the all-time Olympic Games medal table for Winter Olympic Games. When including defunct states, Germany (comprising the former countries of West Germany and East Germany) leads, followed by Norway, Russia (including the former Soviet Union), and the United States."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Independence_Day_(India)",
    "content": "Independence Day is celebrated annually on 15 August as a national holiday in India commemorating the nation's independence from the United Kingdom on 15 August 1947, the day when the provisions of the 1947 Indian Independence Act, which transferred legislative sovereignty to the Indian Constituent Assembly, came into effect. India retained King George VI as head of state until its transition to a republic, when the nation adopted the Constitution of India on 26 January 1950 (celebrated as Indian Republic Day) and replaced the dominion prefix, Dominion of India, with the enactment of the sovereign law Constitution of India. India attained independence following the Independence Movement noted for largely non-violent resistance and civil disobedience.\nIndependence coincided with the partition of India, in which British India was divided along religious lines into the Dominions of India and Pakistan; the partition was accompanied by violent riots and mass casualties, and the displacement of nearly 15 million people due to religious violence. On 15 August 1947, the first Prime Minister of India, Jawaharlal Nehru raised the Indian national flag above the Lahori Gate of the Red Fort in Delhi. On each subsequent Independence Day, the incumbent Prime Minister customarily raises the flag and gives an address to the nation. The entire event is broadcast by Doordarshan, India's national broadcaster, and usually begins with the shehnai music of Ustad Bismillah Khan. Independence Day is observed throughout India with flag-hoisting ceremonies, parades and cultural events. It is a national holiday."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Indian_Act",
    "content": "The Indian Act (Loi sur les Indiens, long name An Act to amend and consolidate the laws respecting Indians) is a Canadian act of Parliament that concerns registered Indians, their bands, and the system of Indian reserves. First passed in 1876 and still in force with amendments, it is the primary document that defines how the Government of Canada interacts with the 614 First Nation bands in Canada and their members. Throughout its long history, the act has been a subject of controversy and has been interpreted in different ways by both Indigenous Canadians and non-Indigenous Canadians. The legislation has been amended many times, including \"over five major changes\" made in 2002.The act is very wide-ranging in scope, covering governance, land use, healthcare, education, and more on Indian reserves. Notably, the original Indian Act defines two elements that affect all Indigenous Canadians:\n\nIt says how reserves and bands can operate. The act sets out rules for governing Indian reserves, defines how bands can be created, and defines the powers of \"band councils\". Bands do not have to have reserve lands to operate under the act.\nIt defines who is, and who is not, recognized as an \"Indian\"; that is, who has Indian status. The act defines types of Indian persons who are not recognized as \"registered\" or \"status\" Indians, who are therefore denied membership in bands. In mixed marriage (between someone with Indian status and someone without it), the status of each partner and their children resolved on patrilineal terms. From a postmodern perspective, the act is now viewed as having historically discriminated against women, their claim to status and being registered under the same terms as men. For example, women marrying a non-Indian lost their Indian status, but men who married non-Indians did not lose Indian status. (This was amended in the late 20th century.)The act was passed because the state related differently to First Nations (historically called \"Indians\") as compared to other ethnic groups. The nation of Canada inherited legal arrangements from the colonial periods under France and Great Britain, such as the Royal Proclamation of 1763 and various treaties. Because of the Indian nations' sovereign status in the colonial periods, Canada's constitution specifically assigns Indigenous issues to the federal, rather than provincial, governments, by the terms of Section 91(24) of the Constitution Act, 1867. The Indian Act replaced any laws on the topic passed by a local legislature before a province joined Canadian Confederation, creating a definitive national policy. The act is not a treaty; it is Canada's legal response to the treaties. The act's unilateral nature was imposed on Indigenous peoples after passage by the Canadian government, in contrast to the treaties, which were negotiated. This aspect was resented and resisted by many Indigenous peoples in Canada."
  },
  {
    "url": "https://en.wikipedia.org/wiki/The_Forgotten_Army_-_Azaadi_Ke_Liye",
    "content": "The Forgotten Army – Azaadi Ke Liye is a streaming television series which premiered on Amazon Prime Video on 24 January 2020. The series is directed by Kabir Khan, and is based on true events about the men and women in the Indian National Army (INA) led by Subhash Chandra Bose. The series stars Sunny Kaushal and Sharvari. Kabir Khan made his directorial debut with a documentary titled The Forgotten Army in 1999 which was aired by Doordarshan; and during a promotional talk, Kabir Khan said the current series is a project that is 20 years in the making, based on his initial documentary. The shooting took place in locations such as Thailand, Singapore, Malaysia and Mumbai."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Pan-Indianism",
    "content": "Pan-Indianism is a philosophical and political approach promoting unity, and to some extent cultural homogenization, among different Native American, First Nations, Inuit and Métis (FNIM) groups in the Americas regardless of tribal distinctions and cultural differences.This approach to political organizing is primarily associated with Native Americans organizing for social justice and cultural revitalization in the Continental United States, but has spread to some other Indigenous communities as well.  Inuit and Métis people may consider themselves part of the broader, pan-Aboriginal community, or some variation thereof. Some academics have also used the term pan-Amerindianism to distinguish from other peoples known as \"Indians\". Some pan-Indian organizations seek to pool the resources of Indigenous groups in order to protect the interests of Native peoples across the world.\n\n"
  },
  {
    "url": "https://en.wikipedia.org/wiki/Monsoon_of_South_Asia",
    "content": "The monsoon of South Asia is among several geographically distributed global monsoons. It affects the Indian subcontinent, where it is one of the oldest and most anticipated weather phenomena and an economically important pattern every year from June through September, but it is only partly understood and notoriously difficult to predict. Several theories have been proposed to explain the origin, process, strength, variability, distribution, and general vagaries of the monsoon, but understanding and predictability are still evolving.\nThe unique geographical features of the Indian subcontinent, along with associated atmospheric, oceanic, and geophysical factors, influence the behavior of the monsoon. Because of its effect on agriculture, on flora and fauna, and on the climates of nations such as Bangladesh, Bhutan, India, Nepal, Pakistan, and Sri Lanka – among other economic, social, and environmental effects – the monsoon is one of the most anticipated, tracked, and studied weather phenomena in the region. It has a significant effect on the overall well-being of residents and has even been dubbed the \"real finance minister of India\"."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Plains_Indians",
    "content": "Plains Indians or Indigenous peoples of the Great Plains and Canadian Prairies are the Native American tribes and First Nation band governments who have historically lived on the Interior Plains (the Great Plains and Canadian Prairies) of North America. While hunting-farming cultures have lived on the Great Plains for centuries prior to European contact, the region is known for the horse cultures that flourished from the 17th century through the late 19th century. Their historic nomadism and armed resistance to domination by the government and military forces of Canada and the United States have made the Plains Indian culture groups an archetype in literature and art for Native Americans everywhere.\nThe Plains tribes are usually divided into two broad classifications which overlap to some degree. The first group became a fully nomadic horse culture during the 18th and 19th centuries, following the vast herds of buffalo, although some tribes occasionally engaged in agriculture. These include the  Arapaho, Assiniboine, Blackfoot, Cheyenne, Comanche, Crow, Gros Ventre, Kiowa, Lakota, Lipan, Plains Apache (or Kiowa Apache), Plains Cree, Plains Ojibwe, Sarsi, Nakoda (Stoney), and Tonkawa. The second group were sedentary and semi-sedentary, and, in addition to hunting buffalo, they lived in villages, raised crops, and actively traded with other tribes. These include the Arikara, Hidatsa, Iowa, Kaw (or Kansa), Kitsai, Mandan, Missouria, Omaha, Osage, Otoe, Pawnee, Ponca, Quapaw, Wichita, and the Santee Dakota, Yanktonai and Yankton Dakota."
  },
  {
    "url": "https://en.wikipedia.org/wiki/American_Indian_Movement",
    "content": "The American Indian Movement (AIM) is a Native American grassroots movement founded in July 1968 in Minneapolis, Minnesota, initially centered in urban areas to address systemic issues of poverty, discrimination, and police brutality against Native Americans. AIM soon widened its focus from urban issues to include many Indigenous Tribal issues that Native American groups have faced due to settler colonialism of the Americas. These have included treaty rights, high rates of unemployment, Native American education, cultural continuity, and preservation of Indigenous cultures.AIM was organized by Native American men who had been serving together in prison. They had been alienated from their traditional backgrounds as a result of the United States' Public Law 959 Indian Relocation Act of 1956, which supported thousands of Native Americans in moving from reservations to cities, in an effort to enable them to have more economic opportunities for work. In addition, Public Law 280, otherwise known as the Indian Termination Act, proposed to terminate the federal government's relations with several tribes determined to be far along the path of assimilation. These policies were enacted by the United States Congress under congressional plenary power. As a result, nearly seventy percent of American Indians left their communal homelands on reservations and relocated to urban centers, many in hopes of finding economic sustainability. While many Urban Indians struggled with displacement and such radically different settings, some also began to organize in pan-Indian groups in urban centers. They were described as transnationals.  The American Indian Movement formed in such urbanized contexts, at a time of increasing Indian activism.From November 1969 to June 1971, AIM participated in the occupation of the abandoned federal penitentiary known as Alcatraz, organized by seven Indian movements, including the Indians of All Tribes and Richard Oakes, a Mohawk activist.[4] In October 1972, AIM and other Indian groups gathered members from across the United States for a protest in Washington, D.C., known as the Trail of Broken Treaties. According to public documents obtained under the Freedom of Information Act (FOIA), advanced coordination occurred between federal Bureau of Indian Affairs staff and the authors of a twenty-point proposal drafted with the help of the AIM for delivery to the United States government officials focused on proposals intended to enhance US–Indian relations.\nIn the decades since AIM's founding, the group has led protests advocating indigenous American interests, inspired cultural renewal, monitored police activities, and coordinated employment programs in cities and in rural reservation communities across the United States. They have also allied with indigenous interests outside the United States."
  }
]